[
    {
        "name": "Area Mastery",
        "text": "You've mastered fighting with weapons that affect an area, easily overwhelming your foe's defenses. You gain the following benefits:\r\n- When determining the save DC of a projector canister you control, you can use 8 + your proficiency bonus + your Intelligence modifier, if it would be higher than the item's DC.\r\n- Your projector canisters reduce partial cover by one step (from three-quarters to half or half to one-quarter). If a creature has one-quarter cover, you ignore it entirely.\r\n- When using a projector canister that requires a saving throw and deals damage, you can take a penalty to the save DC equal to your proficiency bonus. If you do so, the item's damage increases by an amount equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Area Mastery",
        "timestamp": "2022-10-18T11:21:03.6321204+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6321204Z'\""
    },
    {
        "name": "Assisting Mastery",
        "text": "You've mastered enabling your allies, boosting them to the dismay of your enemies. You gain the following benefits:\r\n- When you take the Help action and target an ally, you can choose to forgo up to half your speed. If you do so, when that ally makes its ability check to complete the task with advantage, it can reroll one of the dice once. You can not use this feature if you have moved more than half your speed this turn.\r\n\r\n- When you take the Help action and target an enemy, you can choose to forgo up to half your speed. If you do so, when an ally makes its attack roll against the creature with advantage, it can reroll one of the dice once. You can not use this feature if you have moved more than half your speed this turn.\r\n- When you take the Help action, it has a range in feet equal to 5 x your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Assisting Mastery",
        "timestamp": "2022-10-18T11:21:03.6321204+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6321204Z'\""
    },
    {
        "name": "Berserk Mastery",
        "text": "You've mastered returning pain to those who deliver it, becoming a scourge on the battlefield. You gain the following benefits:\r\n- When a creature scores a critical hit against you, you have advantage on the first attack you make against that creature before the end of your next turn. If you would already have advantage, you can instead reroll one of the dice once.\r\n- You have advantage on saving throws that would force you to act against your will, be frightened, or prevent you from attacking a creature.\r\n- When a creature within 5 feet of you deals damage to you with a weapon or unarmed strike, you can use your reaction to make a melee weapon attack or unarmed strike against that creature. On a hit, you deal additional damage equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Berserk Mastery",
        "timestamp": "2022-10-18T11:21:03.6321204+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6321204Z'\""
    },
    {
        "name": "Blindfighting Mastery",
        "text": "You've mastered fighting without sight, finding a home in the darkness that your enemies fear. You gain the following benefits:\r\n- Once per round, when a creature would have disadvantage on an attack roll against you due to being blinded, they must reroll one of the dice once.\r\n- Once per round, when you would have advantage on an attack roll against a creature that is blinded, you can reroll one of the dice once.\r\n- You gain blindsight out to a number of feet equal to 5 x your proficiency bonus. If you already have blindsight, it instead increases by a number of feet equal to 5 x your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Blindfighting Mastery",
        "timestamp": "2022-10-18T11:21:03.6321204+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6321204Z'\""
    },
    {
        "name": "Brawler Mastery",
        "text": "You've mastered using your weight to your advantage, easily wrangling targets around. You gain the following benefits:\r\n- Your improvised weapons use a d6 for damage and gain the versatile (2d4) property.\r\n- Your damage die for your unarmed strikes and natural weapons increases by one step (from 1 to d4, d4 to d6, or d6 to d8).\r\n- Your speed isn't halved by carrying a grappled creature who is the same size category as you or smaller. \r\n- Once on each of your turns, when you hit a creature with an unarmed strike or a weapon wielded in one hand on your turn, you can make an additional unarmed strike against the same target without the aid of your proficiency bonus (no action required).\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Brawler Mastery",
        "timestamp": "2022-10-18T11:21:03.6321204+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6321204Z'\""
    },
    {
        "name": "Counterstrike Mastery",
        "text": "You've mastered returning attacks at those who dare strike you, effortless turning aside their blades while striking them with your own. You gain the following benefits:\r\n- Creatures have disadvantage on damage rolls from opportunity attacks they make that hit you, and you have advantage on damage roll for opportunity attacks you make that hit.\r\n- When you roll a die to reduce the damage you take from a weapon, you have advantage on the die roll.\r\n- Once per round, when a creature provokes an opportunity attack from you, you can choose to gain a special reaction which you can only use to make that opportunity attack. If you do so, you make the opportunity attack without the aid of your proficiency bonus.\r\n- When you would be the target of a weapon attack, you can immediately use your reaction to make an opportunity attack against the target without your proficiency bonus. On a hit, the target suffers the attack's normal effects, and you impose disadvantage on the triggering roll.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Counterstrike Mastery",
        "timestamp": "2022-10-18T11:21:03.6321204+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6321204Z'\""
    },
    {
        "name": "Covert Mastery",
        "text": "You've mastered fighting from unseen angles, gaining an advantage over your foes. You gain the following benefits:\r\n- You can try to hide when you are lightly obscured from the creature from which you are hiding.\r\n- Dim light doesn't impose disadvantage on your Wisdom (Perception) checks that rely on sight.\r\n- When you are hidden from a creature and miss it with an unarmed strike or weapon attack, making the attack doesn't automatically reveal your position.\r\n- Once per turn, when you deal damage to a creature with an unarmed strike or weapon attack while hidden from it, you deal additional damage equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Covert Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Defense Mastery",
        "text": "You've mastered the art of defending yourself, treating your armor as a second skin. You gain the following benefits:\r\n- While you are wearing medium or heavy armor with which you are proficient, when a creature makes a melee attack against you while within your reach, whether the attack hits or misses, you can use your reaction to attempt to shove that creature up to 10 feet directly away from you.\r\n- The time it takes for you to don and doff armor is reduced by half.\r\n- While you are wearing medium or heavy armor with which you are proficient, damage that you take from weapons is reduced by an amount equal to your proficiency bonus. If this would reduce the damage to 0, the damage is instead reduced to 1.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Defense Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Disruption Mastery",
        "text": "Choose one from force- or tech-casting. You've mastered fighting and interfering with casters of the chosen type, confounding their concentration. You gain the following benefits:\r\n- When a creature within 30 feet of you that you can see casts a power, they provoke an opportunity attack from you.\r\n- You have advantage on saving throws against powers cast by creatures you can see if you've dealt damage to them since the start of your last turn.\r\n- Whenever you force a creature to make a saving throw to maintain concentration, the DC for the saving throw increases by an amount equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Disruption Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Dual Wield Mastery",
        "text": "You've mastered fighting with two weapons, becoming a flurry of motion. You gain the following benefits:\r\n- You can engage in Two-Weapon Fighting even when the weapons you are wielding lack the light property.\r\n- You can reload two weapons when you would normally only be able to reload one, and reloading no longer requires a free hand, provided you are wielding separate weapons in each hand.\r\n- Once per round, when you make an opportunity attack while wielding separate weapons in each hand, you can attack with both weapons. Make a separate attack roll with each weapon.\r\n- When you use your bonus action to engage in Two-Weapon Fighting, you can choose to forgo one or more attacks. For each attack you forgo, you gain a +1 bonus to AC until the start of your next turn.\r\n- When you use your bonus action to engage in Two-Weapon Fighting, you can choose to forgo your proficiency bonus. If you do so, you can make an additional attack with that weapon, also without your proficiency bonus. If you would normally make more than one attack with your bonus action, only one attack is made without your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Dual Wield Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Duelist Mastery",
        "text": "You've mastered the art of fighting with a single weapon, making one weapon feel like many. You gain the following benefits:\r\n- You have advantage on ability checks and saving throws to avoid being disarmed.\r\n- While you are wielding a weapon in one hand with which you are proficient and no other weapons, when you take the Attack action, you can choose to attack with haste at the expense of accuracy. Your weapon attack is made without the aid of your proficiency bonus, but you can use your reaction to make an additional weapon attack, also without your proficiency bonus. If you would make more than one attack when you take the Attack action, only one attack is made without your proficiency bonus.\r\n- While you are wielding a weapon in one hand with which you are proficient and no other weapons, when a creature hits you with a melee attack, you can use your reaction to add your proficiency bonus to your AC for that attack, potentially causing the attack to miss you.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Duelist Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Equilibrium Mastery",
        "text": "You've mastered fighting without the confines of armor, treating combat as an elegant dance. You gain the following benefits:\r\n- If you are disarmed, you can use your reaction to immediately catch the weapon.\r\n- While you are wearing light or no armor and not wielding a shield, when a creature misses you with a weapon attack, you can use your reaction to make an unarmed strike or weapon attack against that creature without your proficiency bonus.\r\n- While you are wearing light or no armor and not wielding a shield, when a creature hits you with a weapon attack, you can use your reaction to impose a penalty to the attack roll equal to your proficiency bonus, potentially causing the attack to miss.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Equilibrium Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Explosives Mastery",
        "text": "You've mastered fighting with explosives, causing untold destruction. You gain the following benefits:\r\n- When determining the save DC of a grenade, mine, or missile you control, you can use 8 + your proficiency bonus + your Intelligence modifier, if it would be higher than the item's DC.\r\n- You have advantage on saving throws against grenades, mines, and missiles you control.\r\n- When using a grenade, mine, or missile that requires a saving throw and deals damage, you can take a penalty to the save DC equal to your proficiency bonus. If you do so, the item's damage increases by an amount equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Explosives Mastery",
        "timestamp": "2022-10-18T11:21:03.6331203+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6331203Z'\""
    },
    {
        "name": "Formation Mastery",
        "text": "You've mastered fighting with a partner, learning to move and act as a single unit. You gain the following benefits:\r\n- When you take the Guard action, the guarded ally has advantage on Dexterity saving throws that would affect only them while guarded.\r\n- When a creature misses an ally within 5 feet of you with a weapon attack, you can use your reaction to make a weapon attack against that creature without your proficiency bonus.\r\n- When a creature hits an ally within 5 feet of you with a weapon attack, you can use your reaction to impose a penalty to the attack roll equal to your proficiency bonus, potentially causing the attack to miss.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Formation Mastery",
        "timestamp": "2022-10-18T11:21:03.6341198+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6341198Z'\""
    },
    {
        "name": "Formfighting Mastery",
        "text": "_**Prerequisite:** The ability to cast force powers_\r\nYou've mastered the basics of the known forms of lightsaber combat, wielding your weapon with unparalleled grace. You gain the following benefits:\r\n- You learn three lightsaber forms, detailed later in this chapter. If you already know at least three lightsaber forms, you instead learn seven lightsaber forms.\r\n- Once on each of your turns, before you make a melee weapon attack, you can choose to forgo your proficiency bonus. If you do so, you can engage in one of your lightsaber forms without using your bonus action. If that form lets you make an attack, that attack is also made without your proficiency bonus.\r\n- Once on each of your turns, before you make a melee weapon attack, you can choose to forgo your proficiency bonus. If you do so, and the attack hits, you can choose another creature within 5 feet of it. If the original attack roll would hit the second creature, it takes damage of the weapon's type equal to twice your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Formfighting Mastery",
        "timestamp": "2022-10-18T11:21:03.6341198+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6341198Z'\""
    },
    {
        "name": "Great Weapon Mastery",
        "text": "You've mastered putting the weight of a weapon to your advantage, letting its momentum empower your strikes. You gain the following benefits:\r\n- On your turn, when you score a critical hit or reduce a creature to 0 hit points with a melee weapon attack, you can make one melee weapon attack as a bonus action.\r\n- While you are wielding a two-handed light- or vibro-weapon with which you are proficient, when you miss with a melee weapon attack, you can use your bonus action to repeat the attack against the same target. Any modifications to the original attack roll, such as advantage, disadvantage, or without your proficiency bonus, also affect this attack roll. On a hit, this attack deals kinetic damage equal to your Strength modifier.\r\n- You have advantage on ability checks and saving throws to avoid being disarmed.\r\n- While you are wielding a two-handed light- or vibro-weapon with which you are proficient, before you make a melee weapon attack, you can choose to forgo your proficiency bonus. If the attack hits, you add twice your proficiency bonus to the attack's damage.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Great Weapon Mastery",
        "timestamp": "2022-10-18T11:21:03.6341198+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6341198Z'\""
    },
    {
        "name": "Guerrilla Mastery",
        "text": "You've mastered maneuvering across the battlefield, sliding through openings that others might not see. You gain the following benefits:\r\n- You can move through a hostile creature's space regardless of that creature's size.\r\n- When you hit a creature with an opportunity attack, you can move up to half your speed (no action required) without provoking opportunity attacks from that creature.\r\n- When a hostile creature moves to within 5 feet of you, you can use your reaction to Disengage and move up to half your speed. \r\n- Once per turn, when you hit a creature with a weapon attack, another enemy of the creature is within 5 feet of it, and that enemy isn't incapacitated, you can deal additional damage equal to twice your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Guerrilla Mastery",
        "timestamp": "2022-10-18T11:21:03.6341198+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6341198Z'\""
    },
    {
        "name": "Gunning Mastery",
        "text": "You've mastered using blasters in unique ways, controlling the battlefield. You gain the following benefits:\r\n- When a creature succeeds on the saving throw against the burst or rapid property of your weapon, they take damage equal to the weapon's governing ability modifier.\r\n- You treat the strength number of weapons as one step lower (19 to 17, 17 to 15, 15 to 13, or 13 to 11). If the strength number is 11, you ignore it entirely.\r\n- When you use the burst property of a weapon, you can choose to forgo your proficiency bonus to the save DC. If you do so, each creature that fails the save takes additional damage equal to your proficiency bonus.\r\n- When you use the rapid property of a weapon, you can choose to forgo your proficiency bonus to the save DC. If you do so, and the target fails the save, they take additional damage equal to twice your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Gunning Mastery",
        "timestamp": "2022-10-18T11:21:03.6341198+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6341198Z'\""
    },
    {
        "name": "Mounted Mastery",
        "text": "You've mastered the art of fighting while mounted, moving seamlessly with your companion. You gain the following benefits:\r\n- If your mount is subjected to an effect that allows it to make a Dexterity saving throw to take only half damage, you can use your reaction to have it instead take no damage if it succeeds on the saving throw, and only half damage if it fails.\r\n- While mounted on a controlled beast, you can use your bonus action to have your mount make a single melee attack against a creature within its reach. If you could already use your bonus action to have your mount make an attack, you can instead do so as a reaction on your turn.\r\n- While mounted on a vehicle, you can take a vehicle action with your bonus action, instead of your action. If you could already take a vehicle action as a bonus action, you can instead do so as a reaction on your turn. You can't take the same action twice in one turn.\r\n- Once per turn, you can choose to have advantage on a melee weapon attack roll against an unmounted creature that is smaller than your mount. If the attack hits, you deal additional damage equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Mounted Mastery",
        "timestamp": "2022-10-18T11:21:03.6341198+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6341198Z'\""
    },
    {
        "name": "Onslaught Mastery",
        "text": "You've mastered using your momentum to your advantage, effectively pummeling creatures into submission and keeping them down once they fall. You gain the following benefits:\r\n- When a creature falls prone within 5 feet of you, they provoke an opportunity attack from you.\r\n- When you would have advantage on a melee weapon attack due to a creature being prone, you can reroll one of the dice once.\r\n- When a prone creature within 5 feet of you attempts to stand, they provoke an opportunity attack from you.\r\n- Once on each of your turns, if you move at least 10 feet in a straight line towards a creature immediately before hitting it with a melee weapon attack, you can deal additional damage equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Onslaught Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Poisoner Mastery",
        "text": "You are skilled at with the subtlety of poisons, causing untold destruction. You gain the following benefits:\r\n- When determining the save DC of a poison you control, you can use 8 + your proficiency bonus + your Intelligence modifier, if it would be higher than the item's DC.\r\n- When you apply a poison to a weapon or ammunition, that poison can affect an additional hit or an additional piece of ammunition.\r\n- Creatures suffering from the poisoned condition have disadvantage on saving throws against poisons you control.\r\n- When using a poison that requires a saving throw and deals damage, you can take a penalty to the save DC equal to your proficiency bonus. If you do so, the item's damage increases by an amount equal to twice your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Poisoner Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Secured Mastery",
        "text": "You've mastered fighting with weapons in atypical places, seamlessly transitioning between your armaments. You gain the following benefits:\r\n- You can wield a number of items on each forearm equal to your full Strength modifier, instead of half.\r\n- You can now reload fixed weapons using your reaction or object interaction, instead of just your action or bonus action. If you could already reload the weapon using your reaction or object interaction, once on each of your turns, you can instead reload the weapon (no action required). You must have one free hand to reload.\r\n- Once on each of your turns, when you miss an attack with a weapon that lacks the fixed property, you can make an additional attack against the same target with a fixed weapon without the aid of your proficiency bonus (no action required).\r\n- Once on each of your turns, when you would make a weapon attack with a fixed weapon, you can forgo the attack. If you do so, you can add your proficiency bonus to your AC against one attack that would hit you before the start of your next turn (no action required).\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Secured Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Sentinel Mastery",
        "text": "You've mastered techniques to take advantage of every drop in any enemy's guard; in tight spaces you are indomitable. You gain the following benefits:\r\n- Creatures within your reach provoke opportunity attacks from you even if they take the Disengage action.\r\n- When you take the Dodge action, once per round, you can take two reactions on the same turn, instead of only one. You can only take one reaction per trigger.\r\n- You can use a bonus action to enter a defensive stance that lasts until the start of your next turn. While in your defensive stance, you have a number of special reactions equal to your proficiency bonus that you can only use to make opportunity attacks.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Sentinel Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Sharpshooter Mastery",
        "text": "You've mastered blaster weapons and can easily make shots that others find impossible. You gain the following benefits:\r\n- Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls.\r\n- Your ranged weapon attacks reduce partial cover by one step (from three-quarters to half or half to one-quarter) against targets greater than 30 feet from you. If the target has one-quarter cover, you ignore it entirely.\r\n- Before you make an attack against a target greater than 30 feet from you with a blaster weapon with which you are proficient, you can choose to forgo your proficiency bonus. If the attack hits, you add twice your proficiency bonus to the attack's damage.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Sharpshooter Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Shield Mastery",
        "text": "You've mastered using a shield to defend your allies as well as yourself, strategically imposing your shield to capitalize on its protection. You gain the following benefits:\r\n\r\n- If you aren't incapacitated, you can add your shield's AC bonus to any Dexterity saving throw you make against a power or other harmful effect.\r\n- While you are wielding a shield with which you are proficient, when you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, and you succeed on the saving throw, you can use your reaction to take no damage.\r\n- When a creature you can see damages you while you are wielding a shield with which you are proficient, you can use your reaction to reduce the damage by an amount equal to your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Shield Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Snapshot Mastery",
        "text": "You've mastered getting up close and personal with blaster weapons, maintaining both rate of fire and accuracy. You gain the following benefits:\r\n- Your ranged weapon attacks reduce partial cover by one step (from three-quarters to half or half to one-quarter) against targets within 30 feet of you. If the target has one-quarter cover, you ignore it entirely.\r\n- Other creatures provoke an opportunity attack from you when they move to within 30 feet of you, and you can make ranged weapon attacks with blaster weapons when making opportunity attacks.\r\n- When you take the Attack action targeting a creature within 30 feet while you are wielding a blaster weapon with which you are proficient, you can choose to attack rapidly at the expense of accuracy. Your ranged weapon attack is made without the aid of your proficiency bonus, but you can use your bonus action to make an additional ranged weapon attack, also without your proficiency bonus. If you would make more than one attack when you take the Attack action, only one attack is made without your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Snapshot Mastery",
        "timestamp": "2022-10-18T11:21:03.6351194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6351194Z'\""
    },
    {
        "name": "Split Mastery",
        "text": "You've mastered fighting with interlocking weapons, seamlessly transitioning between twin blades and dual wielding. You gain the following benefits:\r\n- Once on each of your turns, detaching or reattaching your interlocking weapon no longer requires your object interaction.\r\n- You can engage in Double- and Two-Weapon Fighting even when the weapons you are wielding lack the light property.\r\n- Before you make a melee weapon attack while you are wielding separate weapons in each hand with which you are proficient, you can choose to forgo your proficiency bonus. If the attack hits, you add your proficiency bonus to the attack's damage.\r\n- When you use your bonus action to engage in Double-Weapon Fighting, you can choose to forgo your proficiency bonus. If you do so, you can make an additional attack with that weapon, also without your proficiency bonus. If you would normally make more than one attack with your bonus action, only one attack is made without your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Split Mastery",
        "timestamp": "2022-10-18T11:21:03.6361194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6361194Z'\""
    },
    {
        "name": "Spotting Mastery",
        "text": "You've mastered keeping track of your surroundings, noticing things in detail that others miss entirely. You gain the following benefits:\r\n- You no longer have disadvantage on Wisdom (Perception) checks due to an area being lightly obscured in a 120 foot range. \r\n- When a creature rolls a d20 to redirect an attack roll you make to an illusory duplicate, they have disadvantage on the roll.\r\n- When you take the Search action, you give off no indication that you are devoting your attention to finding something.\r\n- When you find a hidden creature using the Search action, it has disadvantage on any ability checks it makes to attempt Hide from you before the start of your next turn.\r\n- When you take the Search action, you have advantage on all ability checks, attack rolls, and saving throws made as a part of that search that occur within a radius in feet equal to 5 x your proficiency bonus.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Spotting Mastery",
        "timestamp": "2022-10-18T11:21:03.6361194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6361194Z'\""
    },
    {
        "name": "Superiority Mastery",
        "text": "You've mastered utilizing maneuvers to enhance your skills on the battlefield, *expanded*. You gain the following benefits:\r\n- You learn one maneuver, detailed in Chapter 13. If you already know at least one maneuver, you instead learn three maneuvers. Your maneuver ability is Strength, Dexterity, or Constitution for physical maneuvers (your choice), your Intelligence, Wisdom, or Charisma for mental maneuvers (your choice), and an ability of your choice for general maneuvers. \r\n- You gain one superiority die. If you already have at least one superiority die, you instead gain two additional superiority dice. Your superiority die is a d4, and it changes as you gain levels: to d6 at 5th level, to d8 at 9th level, to d10 at 13th level, and to d12 at 17th level. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a short or long rest.\r\n- When you use a maneuver on your turn that involves rolling a superiority die, you can use your bonus action to gain advantage on the superiority die roll.\r\n- Choose one maneuver you know. When you would use the chosen maneuver, you can use a d4 instead of expending a superiority die. You can do so a number of times equal to your proficiency bonus. You regain all expended uses when you complete a long rest.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Superiority Mastery",
        "timestamp": "2022-10-18T11:21:03.6361194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6361194Z'\""
    },
    {
        "name": "Throwing Mastery",
        "text": "You've mastered the techniques of throwing weapons, readily blending the weapons with your movements. You gain the following benefits:\r\n- Attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls with thrown weapons.\r\n- When you hit a creature with a ranged attack with a thrown weapon, you have advantage on your next melee weapon attack against that creature before the end of your next turn.\r\n\r\n- Once per turn, you can draw a thrown weapon without using your object interaction.\r\n- Once on each of your turns, you can make a ranged weapon attack with a thrown weapon against a target within the weapon's normal range without the aid of your proficiency bonus (no action required).\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Throwing Mastery",
        "timestamp": "2022-10-18T11:21:03.6361194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6361194Z'\""
    },
    {
        "name": "Twin-Blade Mastery",
        "text": "You've mastered fighting with double-bladed weapons, using both ends to devastating effect. You gain the following benefits:\r\n- While you are wielding a double weapon with which you are proficient, whenever you roll the maximum on a weapon damage die against a creature, you gain a +1 bonus to the next attack roll you make against that creature before the end of your next turn.\r\n- You can engage in Double-Weapon Fighting even when the weapon you are wielding lacks the light property.\r\n- Before you make a melee weapon attack while wielding a double weapon in two hands, you can choose to forgo your proficiency bonus. If the attack hits, you add one and a half times your proficiency bonus to the attack's damage.\r\n- Before you make a melee weapon attack while wielding a double weapon in one hand, you can choose to forgo your proficiency bonus. If the attack hits, you add your proficiency bonus to the attack's damage.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Twin-Blade Mastery",
        "timestamp": "2022-10-18T11:21:03.6361194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6361194Z'\""
    },
    {
        "name": "Versatile Mastery",
        "text": "You've mastered using weapons in different ways, altering your attack patterns mid-swing. You gain the following benefits:\r\n- Once per turn, when you make a melee attack roll while wielding a weapon in two hands, you can attempt to follow up on the attack. If the attack hits, the creature must make a Strength saving throw (DC = 8 + your bonus to attacks with the weapon). On a failed save, the creature is pushed back 5 feet, and you can immediately move into the space it just vacated without provoking opportunity attacks.\r\n- Once per turn, when you make a melee attack roll while wielding a weapon in one hand, the target is wielding a shield, and your other hand is empty, you can use your other hand to pull down the shield (no action required). If you do so, the creature gains no benefit to armor class from its shield for that attack.\r\n- Before you make a melee weapon attack while wielding a versatile weapon in two hands, you can choose to forgo your proficiency bonus. If the attack hits, you add one and a half times your proficiency bonus to the attack's damage.\r\n- Before you make a melee weapon attack while wielding a versatile weapon in one hand, you can choose to forgo your proficiency bonus. If the attack hits, you add your proficiency bonus to the attack's damage.\r\n",
        "metadata": null,
        "contentTypeEnum": 1,
        "contentType": "Core",
        "contentSourceEnum": 1,
        "contentSource": "PHB",
        "partitionKey": "Core",
        "rowKey": "Versatile Mastery",
        "timestamp": "2022-10-18T11:21:03.6361194+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A03.6361194Z'\""
    }
]