[
    {
        "name": "Berserker",
        "description": "On your turn, you can enter a rage as a bonus action if you aren't wearing heavy armor.\r\n\r\nWhile raging, you gain the following benefits:\r\n- You have advantage on Strength checks and Strength saving throws.\r\n- When you make a melee weapon attack using Strength, you gain a +2 bonus to the damage roll.\r\n- You have resistance to kinetic and energy damage.\r\n\r\nIf you are able to cast powers, you can't cast them or concentrate on them while raging.\r\n\r\nYour rage lasts for 1 minute. It ends early if you are knocked unconscious, you don heavy armor, or if your turn ends and you haven't taken a hostile action or taken damage since your last turn. You can also end your rage on your turn as a bonus action.\r\n\r\nYou can use this feature once. You gain an additional use at 11th level. You regain all expended uses when you complete a long rest.\r\n",
        "prerequisite": "No levels in berserker",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Berserker",
        "timestamp": "2022-10-18T11:21:28.0681181+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.0681181Z'\""
    },
    {
        "name": "Consular",
        "description": "You gain the ability to twist your powers to suit your needs. When you cast a force power, you can expend additional force points to modify the power. You gain one of the Force-Empowered Casting options of your choice from those available to the consular class. You gain an additional option at 11th level.\r\n\r\nYou can only spend a number of force points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\r\n",
        "prerequisite": "No levels in consular, the ability to cast force powers",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Consular",
        "timestamp": "2022-10-18T11:21:28.069118+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.069118Z'\""
    },
    {
        "name": "Engineer",
        "description": "Your technological experience lends you an uncommon insight that you can use to bolster your allies. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Potent Aptitude die, a d4. \r\n\r\nOnce within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Potent Aptitude die, but must decide before the GM says whether the roll succeeds or fails. Once the Potent Aptitude die is rolled, it is lost.\r\n\r\nA creature can have only one Potent Aptitude die at a time.\r\n\r\nYou can use this feature a number of times equal to your proficiency bonus. You regain any expended uses when you finish a long rest.\r\n",
        "prerequisite": "No levels in engineer",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Engineer",
        "timestamp": "2022-10-18T11:21:28.069118+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.069118Z'\""
    },
    {
        "name": "Fighter",
        "description": "You learn maneuvers that are fueled by special dice called superiority dice.\r\n\r\n***Maneuvers.*** You learn one maneuver of your choice from those available to the fighter class. You learn an additional maneuver at 11th level. Many maneuvers enhance an attack in some way. You can use only one maneuver per attack, and you may only use each maneuver once per turn.\r\n\r\n***Superiority Dice.*** You have a number of superiority dice equal to your proficiency bonus, which are d4s. A superiority die is expended when you use it. You regain all of your expended superiority dice when you finish a long rest.\r\n\r\n***Saving Throws.*** Some of your maneuvers require your target to make a saving throw to resist the maneuver's effects. The saving throw DC is calculated as follows:\r\n\r\n___\r\n\r\n**Maneuver save DC** = 8 + your proficiency bonus + your Strength or Dexterity modifier (your choice)\r\n\r\n___\r\n",
        "prerequisite": "No levels in fighter",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Fighter",
        "timestamp": "2022-10-18T11:21:28.069118+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.069118Z'\""
    },
    {
        "name": "Guardian",
        "description": "When you hit a creature with a melee weapon attack, you can expend force points to deal additional damage to the target, which is the same type as the weapon's damage. The additional damage is 1d8 for each point spent in this way. You can't deal more than 2d8 additional damage per hit in this way.\r\n\r\nYou can only spend a number of force points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.\r\n",
        "prerequisite": "No levels in guardian, the ability to cast force powers",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Guardian",
        "timestamp": "2022-10-18T11:21:28.069118+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.069118Z'\""
    },
    {
        "name": "Monk",
        "description": "Your practice of martial arts grants you the following benefits:\r\n- You can make an unarmed strike as a bonus action. If you would already make an unarmed strike as a bonus action, you can instead make this strike in addition to that unarmed strike.\r\n- You can take the Disengage action as a bonus action. If you would already Disengage as a bonus action, you can instead also Dodge.\r\n- You can take the Dash action as a bonus action. If you would already Dash as a bonus action, you can instead double your jump distance for the turn.\r\n\r\nYou can use these features a combined number of times equal to your proficiency bonus. You regain all expended uses when you complete a long rest.\r\n",
        "prerequisite": "No levels in monk",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Monk",
        "timestamp": "2022-10-18T11:21:28.069118+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.069118Z'\""
    },
    {
        "name": "Operative",
        "description": "You know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with a weapon attack if you have advantage on the attack roll. This damage is the same as the weapon's damage, and the attack must use a finesse or a ranged weapon.\r\n\r\nYou don't need advantage on the attack roll if another enemy of the target is within 5 feet of it, that enemy isn't incapacitated, and you don't have disadvantage on the attack roll.\r\n\r\nYou can deal this additional damage a number of times equal to your proficiency bonus. You regain all expended uses when you complete a long rest.\r\n",
        "prerequisite": "No levels in operative",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Operative",
        "timestamp": "2022-10-18T11:21:28.0701174+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.0701174Z'\""
    },
    {
        "name": "Scholar",
        "description": "You are able to analyze a target, develop a plan on how to best overcome any potential obstacle, and execute that plan with ruthless efficiency. As a bonus action on your turn, you can analyze a target you can see within 60 feet of you. For the next minute, or until you analyze another target, you gain the following benefits:\r\n- When you analyze a hostile creature, your attack and damage rolls made with weapons with the finesse property or blaster weapons against that target may use your Intelligence modifier instead of Strength or Dexterity.\r\n- When you analyze a friendly creature, the target can end your Critical Analysis on them (no action required) to add your Intelligence modifier to one attack roll, ability check, or saving throw. Once a friendly creature has benefited from this ability, they can not do so again until they complete a short or long rest.\r\n\r\nYou can use this feature a number of times equal to half your proficiency bonus, rounded up. You regain all expended uses when you complete a long rest.\r\n",
        "prerequisite": "No levels in scholar",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Scholar",
        "timestamp": "2022-10-18T11:21:28.0701174+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.0701174Z'\""
    },
    {
        "name": "Scout",
        "description": "You learn how to effectively read and track your prey. Once on each of your turns, you can choose a creature you can see within 120 feet and mark it as your quarry (no action required). For the next hour, you gain the following benefits:\r\n- Once per turn, when you hit the target with a weapon attack, you can deal 1d4 additional damage to it of the same type as the weapon's damage. \r\n- You have advantage on any Wisdom (Perception) or Wisdom (Survival) check you make to find it while it's on the same planet as you.\r\n\r\nYou can only have one creature marked in this way at a time. You can mark creatures in this way a number of times equal to half your proficiency bonus, rounded up. You regain all expended uses when you complete a long rest.\r\n",
        "prerequisite": "No levels in scout",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Scout",
        "timestamp": "2022-10-18T11:21:28.0701174+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.0701174Z'\""
    },
    {
        "name": "Sentinel",
        "description": "When you hit a creature with a melee weapon attack, you can spend 1 force point to use a Force-Empowered Self effect. You have three such effects: Deflection, Double Strike, and Slow Time. You can only use each effect once per turn, and you can only use one effect per hit.\r\n\r\n***Deflection.*** You can roll a d4 and add it to your AC against one attack before the start of your next turn.\r\n\r\n***Double Strike.*** You can roll a d4 and deal additional damage of the same type equal to the amount rolled.\r\n\r\n***Slow Time.*** You can roll a d4 to increase your speed by 5 x the amount rolled until the end of your turn.\r\n\r\nYou can only spend a number of force points in this way equal to your proficiency bonus. You regain the ability to do so when you complete a long rest.",
        "prerequisite": "No levels in sentinel, the ability to cast force powers",
        "metadata": null,
        "contentTypeEnum": 2,
        "contentType": "ExpandedContent",
        "contentSourceEnum": 5,
        "contentSource": "EC",
        "partitionKey": "ExpandedContent",
        "rowKey": "Sentinel",
        "timestamp": "2022-10-18T11:21:28.0701174+00:00",
        "eTag": "W/\"datetime'2022-10-18T11%3A21%3A28.0701174Z'\""
    }
]