{
    "feature": [
        {
            "name": "Survivor",
            "text": "_**Assault Specialist:** 18th level_\r\nYou attain the pinnacle of resilience in battle. At the start of each of your turns, you regain hit points equal to 5 + your Constitution modifier if you have no more than half your hit points left. You don't gain this benefit if you have 0 hit points.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Assault Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Assault Specialist-Survivor-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Brawn",
            "text": "_**Ballistic Approach:** 14th level_\r\nWhen you use the burst property of a blaster with which are you proficient, you can apply your rage damage bonus to every target that takes damage, instead of just one. Additionally, when a creature fails the saving throw against your burst or rapid property, it is knocked prone.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Ballistic Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Ballistic Approach-Brawn-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Distracting Countenance",
            "text": "_**Beguiler Practice:** 17th level_\r\nAs a bonus action, you can mask yourself with the Force for 1 minute or until you are incapacitated. For the duration, whenever any creature tries to attack you for the first time on a turn, the attacker must make a Charisma saving throw (DC = 8 + your proficiency bonus + your Charisma modifier). On a failed save, it can't attack you on this turn, and it must choose a new target for its attack or the attack is wasted. On a successful save, it can attack you on this turn, but it has disadvantage on any saving throw it makes against your powers on your next turn.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Beguiler Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Beguiler Practice-Distracting Countenance-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Adaptive Barrier",
            "text": "_**Bulwark Technique:** 15th level_\r\nWhen your personal barrier takes damage, you can have it gain resistance to subsequent damage of that type until the start of your next turn (no action required). If it takes damage of more than one type simultaneously, you can choose which type it gains resistance to. Your barrier can only have resistance to one type of damage at a time.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Bulwark Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Bulwark Technique-Adaptive Barrier-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Sovereign Protector",
            "text": "_**Crimson Order:** 17th level_\r\nYour mastery of focus has allowed you to unlock your fullest potential in combat. As a bonus action, you can gain the following effects for 1 minute.\r\n- Your speed is doubled.\r\n- Your AC increases by 2.\r\n- You have advantage on Dexterity saving throws.\r\n- You gain an additional action of each of your turns. This action can be used only to take the Attack (one weapon attack only), Dash, Disengage, Hide, or Use an Object action.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Crimson Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Crimson Order-Sovereign Protector-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Field Surgeon",
            "text": "_**Doctor Pursuit:** 6th and 11th level_\r\nWhenever you expend superiority dice to restore hit points or grant temporary hit points to a creature, you can roll an additional die d6 and add it to the roll. This die increases to d8 at 9th level, d10 at 13th level, and d12 at 17th level.\r\nAdditionally, whenever you expend superiority dice to restore hit points or grant temporary hit points to a creature, if the creature is the target of your Critical Analysis, you can instead choose the maximum on both dice. Once you've used this feature, you must finish a short or long rest before you can use it again. Starting at 11th level, you can use it twice before a rest, but only once on the same turn.",
            "level": 6,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Doctor Pursuit",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Doctor Pursuit-Field Surgeon-6",
            "timestamp": "2021-10-12T11:17:35.3168147+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A35.3168147Z'\""
        },
        {
            "name": "Unerring Accuracy",
            "text": "_**Echani Order:** 17th level_\r\nYour mastery of weapons grants you extraordinary accuracy. If you miss with an attack roll using a monk weapon on your turn, you can reroll it. You can use this feature only once on each of your turns.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Echani Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Echani Order-Unerring Accuracy-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Quickdraw",
            "text": "_**Gunslinger Practice:** 17th level_\r\nYou learn to perform miracles with just a blaster and some nerve. On your first turn in combat, if you aren't surprised, you can use your action to attack creatures that have not yet acted. Choose up to six such creatures that you can see, making a ranged weapon attack against each. On a hit, you deal normal weapon damage and can apply a single trick shot to each attack made this way.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Gunslinger Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Gunslinger Practice-Quickdraw-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Pure Performance",
            "text": "_**Heavy Weapons Specialist:** 18th level_\r\nAt 18th level, attack rolls you make while wielding a weapon with the heavy or strength properties can't suffer from disadvantage.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Heavy Weapons Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Heavy Weapons Specialist-Pure Performance-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Contention",
            "text": "_**Makashi Form:** 20th level_\r\nYou are a duelist of the highest caliber. Your Dexterity and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic and energy damage, and you ignore resistance to kinetic and energy damage.\r\n- All melee attacks have disadvantage against you.\r\n- Your melee weapon attacks inflict an additional damage die.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Makashi Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Makashi Form-Master of Contention-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Force Storm",
            "text": "_**Marauder Approach:** 14th level_\r\nYou can expel the might of your rage all at once to unleash a devastating storm of force energy. As an action, you can end your rage early, forcing each creature within 15 feet of you to make a Dexterity saving throw against your universal force save DC. On a failed save, a creature takes 1d12 force damage for each round you've spent in rage, or half as much on a successful one.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Marauder Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Marauder Approach-Force Storm-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Control the Field",
            "text": "_**Matukai Order:** 17th level_\r\nWhenever you use your Instinctive Leap feature, you can leap your entire movement speed instead of only half. Additionally, when you land, you can make an unarmed strike with advantage against a creature within 5 feet of you as part of the same reaction. On a hit, this attack deals an additional 2d6 force damage.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Matukai Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Matukai Order-Control the Field-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Spirit Blade Assault",
            "text": "_**Nightsister Order:** 17th level_\r\nAs an action, you conjure a blade of spirit energy and strike one creature within 5 feet of you with it, expending 1 to 10 focus points. The target must make a Constitution saving throw. On a failed save, it takes 2d10 necrotic damage per focus point spent, or half as much on a successful one.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Nightsister Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Nightsister Order-Spirit Blade Assault-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Moderation",
            "text": "_**Niman Form:** 20th level_\r\nThe Force flows in perfect concert with your weapon attacks. Your Dexterity and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic and energy damage from unenhanced weapons.\r\n- You have advantage on saving throws against force powers. Additionally, you have resistance against the damage of force powers.\r\n- When you use your action to cast an at-will force power that targets only one creature, you can target an additional creature within 5 feet of the original target and within the power's range.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Niman Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Niman Form-Master of Moderation-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Retaliatory Strike",
            "text": "_**Path of Aggression:** 18th level_\r\nWhen a creature hits you with an attack while within 5 feet of you, you can use your reaction to cast the lightning charge force power, targeting them.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Aggression",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Aggression-Retaliatory Strike-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master Strike",
            "text": "_**Path of Focus:** 18th level_\r\nAt 18th level, your bursts can overpower even the fiercest of foes. Once on your turn, when a creature takes damage from you three times, you can force it to make a Constitution saving throw against your universal force save DC. On a failed save, it becomes stunned until the end of its next turn.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Focus",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Focus-Master Strike-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Forceblade Mastery",
            "text": "_**Path of the Forceblade:** 18th level_\r\nYou've mastered controlling your forceblade with your mind, using it to keep your enemies at bay. As an action, you can telekinetically control your forceblade and have it strike any number of creatures within 10 feet of you, spending 1 force point per target. Each target must make a Dexterity saving throw (DC = 8 + your bonus to weapon attack rolls with that weapon). On a failed save, it takes damage using your Kinetic Combat die + half your sentinel level (rounded down), is pushed back 10 feet and knocked prone.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of the Forceblade",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of the Forceblade-Forceblade Mastery-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Calm Within the Storm",
            "text": "_**Precision Approach:** 14th level_\r\nThe precision with which you act during your rage causes you to become a storm of reactive lethality. When you use your Reckless Attack feature, you can make a number of opportunity attacks equal to your proficiency bonus without using your reaction, and when a creature within 5 feet of you misses you with an attack, you can use your reaction to make a melee weapon attack using Dexterity against that creature. You can only take one reaction per turn.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Precision Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Precision Approach-Calm Within the Storm-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Double Tap",
            "text": "_**Sharpshooter Practice:** 17th level_\r\nYou've learned to capitalize when you have the advantage. When you take the Attack action and make an attack with advantage, you can choose to forgo the advantage. If you do, you can make an additional attack against the target or another creature within 5 feet of it (no action required). Both attacks can benefit from your Sneak Attack damage, instead of only one.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Sharpshooter Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Sharpshooter Practice-Double Tap-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Greater Inspiring Surge",
            "text": "_**Shield Specialist:** 18th level_\r\nYou can choose two allies within 60 feet of you, rather than one, when you using your Inspiring Surge feature.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Shield Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Shield Specialist-Greater Inspiring Surge-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Perseverance",
            "text": "_**Shien/Djem So Form:** 20th level_\r\nYour might overwhelms even the most implacable of foes. Your Strength and Constitution scores increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic and energy damage from unenhanced weapons.\r\n- Once per turn, when you hit with a melee weapon attack using Strength, you can use your Force-Empowered Strikes feature at 1st-level without expending force points. You gain temporary hit points equal to the extra damage dealt.\r\n- When a creature within 5 feet of you makes an attack roll against you, you can use your reaction to make a single weapon attack with advantage against that creature. If the attack hits, you impose disadvantage on the triggering attack roll.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Shien/Djem So Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Shien/Djem So Form-Master of Perseverance-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Resilience",
            "text": "_**Soresu Form:** 20th level_\r\nYour presence on the field of battle is an inspiration to your allies. Your Constitution and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic and energy damage from unenhanced weapons.\r\n- When you use the saber reflect force power, you can make a single melee attack on an enemy within 5ft of you as a part of that same reaction.\r\n- You have advantage on Dexterity saving throws, as do your allies within 30 feet of you.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Soresu Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Soresu Form-Master of Resilience-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Maneuver Mastery",
            "text": "_**Tactical Specialist:** 18th level_\r\nOnce per round, when you would roll a Superiority Die, you can instead choose the maximum.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Tactical Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Tactical Specialist-Maneuver Mastery-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Engineering Bombardment",
            "text": "_**Unstable Engineering:** 18th level_\r\nThe harmful energies of your tech powers and class features intensify. When you roll damage for a tech power or class feature and roll the highest number possible on any of the dice, you can roll it again and use both results. You can only use this ability once per tech power or class feature.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Unstable Engineering",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Unstable Engineering-Engineering Bombardment-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "War Chant",
            "text": "_**Warchief Approach:** 14th level_\r\nYou have memorized the litanies, songs, and chants of your people and their dedication to war. When you enter a rage on your turn, you can enter a commanding rage for one minute. When you do so, during this turn and at the start of each of your turns, you have a number of special reactions equal to your proficiency bonus you can only use for your Commanding Rage feature. When you use Commanding Rage with these special reactions, they do not count against your uses of that feature. You can only use one reaction per turn. Additionally, during this rage, when an enemy within 10 feet of you makes an attack roll against an ally, you can use your reaction to reduce the attack by an amount equal to your Charisma modifier.\r\nOnce you've used this feature, you must complete a long rest before you can use it again.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Warchief Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Warchief Approach-War Chant-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Force Resistance",
            "text": "_**Way of Balance:** 18th level_\r\nStarting at 18th level, you have advantage on saving throws against force powers. Additionally, you have resistance against the damage of force powers.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Balance",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Balance-Force Resistance-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Unlimited Power",
            "text": "_**Way of Lightning:** 18th level_\r\nYou can increase the power of your simpler lightning force powers. When you cast a force power of 1st through 6th level that deals lightning damage, you can deal maximum damage with that power.\r\nYou can use this feature with no adverse effects a number of times equal to your Wisdom or Charisma modifier (your choice, a minimum of once). If you use this feature beyond this before you finish a long rest, you take 2d12 true damage for each level of the power, immediately after you cast it. Each time you use this feature again before finishing a long rest, the damage increases by 1d12.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Lightning",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Lightning-Unlimited Power-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Subtle Presence",
            "text": "_**Way of Suggestion:** 18th level_\r\nYou've learned how to weave the Force around you in a cloak of your choice. As an action, you can focus the Force for 10 minutes. For the duration, you gain your choice of one of the following effects.\r\nYou can use each feature once. You regain all expended uses when you complete a long rest.\r\n#### Cloak of Fright\r\nEach creature of your choice that is within 60 feet must succeed on a Wisdom saving throw against your universal force save DC or become frightened for 1 minute. A creature can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\r\n#### Cloak of Invisibility\r\nYou and everything you are wearing or carrying become invisible to creatures of your choice. If you damage a creature or affect it with a force power, it can make a Wisdom saving throw against your universal force save DC. On a success, you are no longer invisible to that creature.\r\n#### Cloak of Memory\r\nCreatures that see you or any allies within 30 feet of you during this time cannot recall your physical appearances, your mannerisms, or any other identifying features.\r\nCreatures that interact with you must make a Wisdom saving throw against your universal force save DC once the interaction ends. You can choose to exclude a creature from this effect. On a failed save, the creature forgets all details of the interaction, rationalizing any of its outcomes.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Suggestion",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Suggestion-Subtle Presence-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Supreme Healing",
            "text": "_**Way of the Sage:** 18th level_\r\nWhen you would normally roll one or more dice to restore hit points with a power, you instead use the highest number possible for each die. For instance, instead of restoring 2d6 hit points to a creature, you restore 12.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of the Sage",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of the Sage-Supreme Healing-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Fuel the Rampage",
            "text": "_**Addicted Approach:** 14th level_\r\nWhile you are both raging and experiencing the high of a substance, having 0 hit points doesn't knock you unconscious. You still must make death saving throws, and you suffer the normal effects of taking damage while at 0 hit points. However, if you would die due to failing death saving throws, you don't die until your rage ends, and you die then only if you still have 0 hit points.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Addicted Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Addicted Approach-Fuel the Rampage-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Instant Acceleration",
            "text": "_**Adept Specialist:** 18th level_\r\nYou reach the pinnacle of your training, moving faster than eyes or most sensors can track. When you use Action Surge feature, you can teleport up to 30 feet to an unoccupied space you can see. You can teleport before or after the additional action.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Adept Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Adept Specialist-Instant Acceleration-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Iridescent Strikes",
            "text": "_**Aing-Tii Order:** 17th level_\r\nWhen you use your action to cast a force power, you can spend 2 focus points to teleport to a space within 5 feet of a creature affected by the power and make two unarmed strikes against that creature as a bonus action.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Aing-Tii Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Aing-Tii Order-Iridescent Strikes-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Adaptation",
            "text": "_**Aqinos Form:** 20th level_\r\nYour masteries of the Force and technology have achieved equilibrium. Your Constitution and Wisdom or Charisma (your choice) scores increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to ion damage, and you can't have disadvantage on saving throws against ion or lightning damage.\r\n- You can't have disadvantage on attack rolls you make as a part of a tech power, and enemies can't have advantage on saving throws against your tech powers.\r\n- You add your governing ability modifier (minimum of +1) to any damage or healing you do with tech powers you cast that don't already include that modifier.\r\nWhile you are conscious and your droid is within 60 feet of you and conscious, it also gains these benefits.\r\nThis effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Aqinos Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Aqinos Form-Master of Adaptation-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Modified Lightsaber",
            "text": "_**Artificer Engineering:** 3rd and 9th level_\r\nYou learn to modify an unenhanced lightsaber utilizing your artificer knowledge. Over the course of a long rest, you can modify your lightsaber. You must have the lightsaber and artificer's implements in order to perform this modification.\r\nYour modified lightsaber is enhanced, requires attunement, can only be used by you, and counts as a tech focus for your tech powers while you are attuned to it. Your modified lightsaber has 4 modification slots, and it gains more at higher levels, as shown in the Modification Slots column of the engineer table. For each modification installed in excess of your proficiency bonus, your tech point maximum is reduced by 1. Over the course of a long rest, you can install, replace, or remove a number of modifications up to your Intelligence modifier (minimum of one).\r\nSome modification effects require saving throws. When you use such an effect from this class, the DC equals your tech save DC.\r\nAt 9th level, you can maintain two different modified lightsabers. The total modification slots are split across the two items.",
            "level": 3,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Artificer Engineering",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Artificer Engineering-Modified Lightsaber-3",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Ordnance",
            "text": "_**Artillerist Technique:** 15th level_\r\nYou can now expend two uses of your Modular Munitions feature when you cast a tech power to apply two empowerment effects, instead of only one. Additionally, you gain three additional empowerment effects:\r\n- **Confusion**: Each creature damaged by this power must make a Charisma saving throw. On a failure, on its next turn, a creature must use its action to make a melee attack against a randomly determined creature within its reach. If there is no creature within its reach, the creature does nothing this turn.\r\n- **Knockout**: Each creature damaged by this power must succeed on a Strength saving throw or be knocked prone.\r\n- **Static**: Each creature damaged by this power must succeed on an Intelligence saving throw or become shocked until the start of your next turn.\r\nAdditionally, when you would spend 1 tech point to apply an empowerment effect, it no longer reduces your maximum tech points.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Artillerist Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Artillerist Technique-Master of Ordnance-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Battlefront",
            "text": "_**Artillerist Technique (Companion):** 15th level_\r\nWhen you use your Combat Tech feature, both you and your turret can each make one weapon attack as part of the same bonus action.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Artillerist Technique (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Artillerist Technique (Companion)-Battlefront-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Droid Defense",
            "text": "_**Astrotech Engineering (Companion):** 18th level_\r\nWhile your droid can see you, it has advantage on all saving throws.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Astrotech Engineering (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Astrotech Engineering (Companion)-Droid Defense-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Aggression",
            "text": "_**Ataru Form:** 20th level_\r\nYour presence on the field of battle is as a graceful blur of deadly blades and daring acrobatics. Your Dexterity and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic, energy, and ion damage from weapons.\r\n- When an ally within 30 feet of you takes the Attack action, they can make one additional attack as a part of that same action.\r\n- When you hit a creature with a weapon attack, you can move up to 10 feet. This movement does not provoke opportunity attacks.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Ataru Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Ataru Form-Master of Aggression-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Bladestorm",
            "text": "_**Blademaster Specialist:** 18th level_\r\nYou can use your action to make a single melee weapon attack against each creature within your reach. Make a separate attack roll against each target. The first attack gains a +1 bonus to its attack roll, and each attack after the first gains an additional +1 bonus to its attack roll, cumulatively, to a maximum bonus of +6. If you are wielding two light- or vibro-weapons, or a weapon with the double property, you also add this bonus to your damage rolls, and you can use your bonus action to engage in Double- or Two-Weapon Fighting.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Blademaster Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Blademaster Specialist-Bladestorm-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Raging Whirlwind",
            "text": "_**Bloodstorm Approach:** 14th level_\r\nYou can send your weapon spinning into a gravity-defying whirlwind of pain. Once per rage as an action, you may throw a weapon with the thrown property to a point you choose within 60 feet. The weapon fills the air as a cyclone in a 10 foot radius sphere centered on that point. A creature takes damage equal to the thrown weapon's damage + your Strength modifier + your Rage Damage when it enter's the whirlwind's area for the first time on a turn or starts its turn there. This effect ends when you command the weapon to return to you (no action required) or your rage ends.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Bloodstorm Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Bloodstorm Approach-Raging Whirlwind-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Squad Goals",
            "text": "_**Bolstering Practice:** 17th level_\r\nBy 17th level, you have such skill at maintaining the faith your allies have in you, that the very sight of you in danger can spur them into action. When seeing you take damage from an enemy's attack, a number of allies equal to your charisma modifier within 60 feet of you, that can see you, may immediately make a single attack of opportunity against the enemy, no action required. You may use this feature once, regaining the ability to do so when you finish a short or long rest.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Bolstering Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Bolstering Practice-Squad Goals-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Enforcer",
            "text": "_**Brawling Approach:** 14th level_\r\nWhen you would make an unarmed strike or attack with an improvised weapon with advantage, you can choose to forgo the advantage. If you do so, your critical hit range increases by 1 for that attack, and on a hit, you deal maximum damage instead of rolling.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Brawling Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Brawling Approach-Enforcer-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master Builder",
            "text": "_**Construction Engineering:** 18th level_\r\nYour ability with your portable structures has reached untold superiority. You gain the following benefits:\r\n- You can have two structures active at a time, instead of only one, as you learn to more efficiently use your portable structure.\r\n- Your structures no longer take double damage from the siege property.\r\n- Your structures no longer automatically fail Strength, Dexterity, and Constitution saving throws. Instead, your structure adds your proficiency bonus to the d20 roll when it makes one of these saving throws.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Construction Engineering",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Construction Engineering-Master Builder-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Tornado",
            "text": "_**Cyclone Approach:** 14th level_\r\nYou can become a tornado of attacks. When you take the Attack action on your turn, you can forgo one of your regular attacks to make a melee attack against any number of creatures within 5 feet of you, with a separate attack roll for each target. If you are wielding a separate melee weapon in each hand, each successful hit against a target deals damage equal to the damage dice of both weapons + your ability modifier + any other modifiers.\r\nYou can use this feature a number of times equal to your Strength modifier (a minimum of once). You regain all expended uses when you finish a short or long rest.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Cyclone Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Cyclone Approach-Tornado-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Overwatch",
            "text": "_**Deadeye Technique:** 15th level_\r\nYou have become a master at protecting your allies from afar. When a creature attempts to make an opportunity attack against an allied creature, or forces your ally to make a saving throw, you can use your reaction to make an attack roll against the enemy creature.\r\nIf your attack hits, either impose disadvantage on the enemy creature's opportunity attack roll or grant advantage to any allies making the saving throw.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Deadeye Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Deadeye Technique-Overwatch-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Bombard",
            "text": "_**Demolitions Specialist:** 18th level_\r\nWhen a creature fails its saving throw against a charge or grenade thrown by you, it has disadvantage on the next Dexterity saving throw it makes before the end of your next turn.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Demolitions Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Demolitions Specialist-Bombard-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Neck Snap",
            "text": "_**Disabling Practice:** 17th level_\r\nYou learn how to immediately remove your grappled opponent from the fight. As an action, you can force a creature grappled by you to make a Constitution saving throw. On a failed save, if the creature has 100 hit points or fewer, it dies. If the target has more than 100 hit points, it immediately takes 10d10 true damage.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Disabling Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Disabling Practice-Neck Snap-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Ammunition Upgrades",
            "text": "_**Enhancement Specialist:** 18th level_\r\nYour ammunition enhancements improve.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Enhancement Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Enhancement Specialist-Ammunition Upgrades-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "The Beauty of Violence",
            "text": "_**Exhibition Specialist:** 18th level_\r\nYou've perfected a fighting style that allows you to stylishly dominate the field of battle. When you mark a creature with your In The Spotlight feature, you can enhance it. For the duration of the mark, you gain the following additional benefits:\r\n- You can add your full Charisma modifier, instead of half, to any weapon damage roll you make against the marked target that doesn't already include that modifier.\r\n- You can add half your Charisma modifier (minimum of one) to any weapon attack roll you make against the marked target that doesn't already include that modifier.\r\n- If the marked target is reduced to 0 hit points, you can use your reaction to mark a new creature within 30 feet of you. The duration of the new mark is equal to the remaining duration of the existing mark.\r\nThis effect ends early if you're incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Exhibition Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Exhibition Specialist-The Beauty of Violence-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Retaliation",
            "text": "_**Frenzied Approach:** 14th level_\r\nWhen you take damage from a creature that is within 5 feet of you, you can use your reaction to make a melee weapon attack against that creature.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Frenzied Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Frenzied Approach-Retaliation-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Improved Decoys",
            "text": "_**Illusionist Technique:** 15th level_\r\nYou can create up to four duplicates of yourself, instead of one, when you use your Holographic Decoy feature. When you use your bonus action to move a decoy, you can move any number of them with the same bonus action.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Illusionist Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Illusionist Technique-Improved Decoys-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Final Countdown",
            "text": "_**Industrial Approach:** 14th level_\r\nWhen you are reduced to 0 hit points but not killed outright, and you have at least one tech point remaining, you can expend all your remaining tech points and instead to drop to one hit point (no action required). If you do so, each creature within 30 feet of you must make a Dexterity saving throw against your tech save DC. On a failed save, they take 1d12 acid, cold, fire, ion, or lightning damage (your choice) damage for each tech point spent in this way, or half as much on a successful one.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Industrial Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Industrial Approach-Final Countdown-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Force Resistance",
            "text": "_**Inquisitor Technique:** 11th and 17th level_\r\nWhile the target of your Ranger's Quarry feature is within 30 feet of you, you gain the following benefits:\r\n- You have advantage on saving throws against force powers they cast.\r\n- You have resistance to damage dealt by force powers they cast. \r\nThe radius of this feature increases to 60 feet at 17th level.",
            "level": 11,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Inquisitor Technique",
            "metadata": null,
            "partitionKey": "ExpandedContent",
            "rowKey": "Archetype-Inquisitor Technique-Force Resistance-11",
            "timestamp": "2021-10-12T11:17:48.0024088+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A48.0024088Z'\""
        },
        {
            "name": "Debilitating Barrage",
            "text": "_**Jal Shey Order:** 17th level_\r\nYou've gained the knowledge to temporarily inhibit a creature's fortitude by striking a series of pressure points. Whenever you hit a creature with an unarmed strike, you can spend 3 focus points to cause the creature to become vulnerable to a damage type of your choice. This effect lasts for 1 minute or until they take damage of the chosen type.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Jal Shey Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Jal Shey Order-Debilitating Barrage-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Domination",
            "text": "_**Jar'Kai Form:** 20th level_\r\nYou are a whirlwind of strikes, eviscerating all who step within your reach. Your Strength and Dexterity scores increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic, energy, and ion damage from weapons.\r\n- When you hit a creature with a melee weapon attack, you have advantage on the next melee weapon attack roll you make against that creature, and that creature provokes an opportunity attack from you even if they take the Disengage action before leaving your reach until the end of your next turn.\r\n- Creatures provoke an opportunity attack from you when they enter your reach.\r\nThis effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Jar'Kai Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Jar'Kai Form-Master of Domination-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Relentless Approach",
            "text": "_**Juggernaut Approach:** 14th level_\r\nYou're able to charge in unerring bursts. As an action, you can charge up to twice your speed in a straight line without provoking opportunity attacks. Each creature within 5 feet of your path must make a Strength or Dexterity saving throw (DC = 8 + your proficiency bonus + your Strength modifier, the target chooses the ability they use use). On a failed save, a creature takes damage equal to your Strength modifier + your Rage Bonus and is pushed back 5 feet in a direction of your choice. Creatures smaller than you make this save with disadvantage. When you end this movement, if a creature is within 5 feet of you, you can make one melee weapon attack (no action required). On a hit, the creature takes additional damage equal to your berserker level.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Juggernaut Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Juggernaut Approach-Relentless Approach-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Ferocity",
            "text": "_**Juyo/Vaapad Form:** 20th level_\r\nYou are a paragon of extraordinary martial prowess. Your Strength and Dexterity scores increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to all damage.\r\n- When you take the Attack action on your turn, you can make one additional attack as part of that action.\r\n- Your critical hit range with weapons increases by 1.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you complete a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Juyo/Vaapad Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Juyo/Vaapad Form-Master of Ferocity-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Relentless Assault",
            "text": "_**Juggernaut Approach:** 14th level_\r\nYou're able to charge in unerring bursts. As an action, you can charge up to twice your speed in a straight line without provoking opportunity attacks. Each creature within 5 feet of your path must make a Strength or Dexterity saving throw (DC = 8 + your proficiency bonus + your Strength modifier, the target chooses the ability they use use). On a failed save, a creature takes damage equal to your Strength modifier + your Rage Bonus and is pushed back 5 feet in a direction of your choice. Creatures smaller than you make this save with disadvantage. When you end this movement, if a creature is within 5 feet of you, you can make one melee weapon attack (no action required). On a hit, the creature takes additional damage equal to your berserker level.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Juggernaut Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Juggernaut Approach-Relentless Assault-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Opportunist",
            "text": "_**Kage Order:** 17th level_\r\nYou can exploit a creature's momentary distraction when it is hit by an attack. Whenever a creature within 5 feet of you is hit by an attack made by a creature other than you, you can use your reaction to make a melee attack against that creature.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Kage Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Kage Order-Opportunist-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Elemental Master",
            "text": "_**Kro Var Order:** 11th and 17th level_\r\nAt 11th level, you gain one of the following features. You gain an additional option at 17th level.\r\nYou can use these features a combined number of times equal to half your proficiency bonus, as shown in the monk table. You regain all expended uses when you complete a long rest.\r\nWhile you have no remaining uses of this feature, you can instead expend 3 focus points to use it. When you do so, your maximum focus points are reduced by 3 until you complete a long rest.\r\n#### Earth Reaches for Sky\r\n_**Prerequisite:** Crushing Hand of the Mountain_ or _Patient Bantha Listens_\r\nAs an action, you can choose a point you can see on the ground within 120 feet. A fountain of churned earth and stone erupts in a 20-foot cube centered on that point. Each creature in that area must make a Dexterity saving throw. A creature takes 3d12 kinetic damage on a failed save, or half as much damage on a successful one. Additionally, the ground in that area becomes difficult terrain until cleared. Each 5-foot-square portion of the area requires at least 1 minute to clear by hand.\r\n#### Ride the Wind\r\n_**Prerequisite:** Curtain of Unyielding Wind_ or _Rush of the Shyrack_\r\nAs an action, you can gain a flying speed equal to your movement speed for 10 minutes. You can hover while this technique is active, but when it ends, you fall if you are still aloft, unless you can stop the fall.\r\n#### River of Hungry Flame\r\n_**Prerequisite:** Burning Ember Flourish_ or _Hatchling's Flame_\r\nAs an action, you can create a wall of fire on a solid surface within 120 feet. You can make the wall up to 60 feet long, 20 feet high, and 1 foot thick, or a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall is opaque and lasts for 1 minute.\r\nWhen the wall appears, each creature within its area must make a Dexterity saving throw. On a failed save, a creature takes 5d8 fire damage, or half as much damage on a successful save.\r\nOne side of the wall, chosen by you when you use this feature, deals 5d8 fire damage to each creature that ends its turn within 10 feet of that side of the wall. A creature takes the same damage when it enters the wall for the first time on a turn or ends its turn there. The other side of the wall deals no damage.\r\n#### Shape the Flowing River\r\n_**Prerequisite:** Shape the Rainclud_ or _Swarming Ice Rabbit_\r\nAs an action, you can control any freestanding water within 300 feet of you inside an area you choose that is a cube up to 100 feet on a side. You can choose from any of the following effects when you use this feature. As an action on your turn, you can repeat the same effect or choose a different one.***Flood.*** You cause the water level of all standing water in the area to rise by as much as 20 feet. If the area includes a shore, the flooding water spills over onto dry land. If you choose an area in a large body of water, you instead create a 20-foot tall wave that travels from one side of the area to the other and then crashes down. Any Huge or smaller creatures in the wave's path are carried with it to the other side. Any Huge or smaller creatures struck by the wave have a 25 percent chance of being knocked prone. The water level remains elevated until the feature ends or you choose a different effect. If this effect produced a wave, the wave repeats on the start of your next turn while the flood effect lasts. \r\n***Part Water.*** You cause water in the area to move apart and create a trench. The trench extends across the feature's area, and the separated water forms a wall to either side. The trench remains until the feature ends or you choose a different effect. The water then slowly fills in the trench over the course of the next round until the normal water level is restored.\r\n***Redirect Flow.*** You cause flowing water in the area to move in a direction you choose, even if the water has to flow over obstacles, up walls, or in other unlikely directions. The water in the area moves as you direct it, but once it moves beyond the feature's area, it resumes its flow based on the terrain conditions. The water continues to move in the direction you chose until the feature ends or you choose a different effect.\r\n***Whirlpool.*** This effect requires a body of water at least 50 feet square and 25 feet deep. You cause a whirlpool to form in the center of the area. The whirlpool forms a vortex that is 5 feet wide at the base, up to 50 feet wide at the top, and 25 feet tall. Any creature or object in the water and within 25 feet of the vortex is pulled 10 feet toward it. A creature can swim away from the vortex by making a Strength (Athletics) check against your feature save DC. When a creature enters the vortex for the first time on a turn or starts its turn there, it must make a Strength saving throw. On a failed save, the creature takes 2d8 kinetic damage and is caught in the vortex until the feature ends. On a successful save, the creature takes half damage, and isn't caught in the vortex. A creature caught in the vortex can use its action to try to swim away from the vortex as described above, but has disadvantage on the Strength (Athletics) check to do so. The first time each turn that an object enters the vortex, the object takes 2d8 kinetic damage; this damage occurs each round it remains in the vortex.",
            "level": 11,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Kro Var Order",
            "metadata": null,
            "partitionKey": "ExpandedContent",
            "rowKey": "Archetype-Kro Var Order-Elemental Master-11",
            "timestamp": "2021-10-12T11:17:47.9533687+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A47.9533687Z'\""
        },
        {
            "name": "Avatar",
            "text": "_**Kro Var Order:** 17th level_\r\nAs an ultimate display of your mastery of the elements, you can spend 5 focus points as an action to have the elements of water, earth, fire, and air form a protective sphere around your body, gaining multiple benefits for 1 minute. While this ability is active, you have resistance to cold, energy, fire, kinetic, lightning, and sonic damage. You also gain a burrow, fly, and swim speed equal to your movement speed. Lastly, you can use any of the following abilities as a bonus action:\r\n- You create a small earthquake on the ground in a 15-foot radius around you. Each creature in that area must make a Dexterity saving throw. On a failed save, a creature takes 1d6 kinetic damage and is knocked prone.\r\n- You create a line of fire 15 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 3d6 fire damage on a failed save, or half as much damage on a successful one.\r\n- You create a 15-foot cube of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Constitution saving throw. A creature takes 1d10 kinetic damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the cube.\r\n- You create a 15-foot cone of ice shards extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution save throw. A creature takes 2d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Kro Var Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Kro Var Order-Avatar-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Relentless Assault",
            "text": "_**Kyuzo Order:** 17th level_\r\nWhen you make multiple weapon attacks with thrown weapons against the same target on your turn, each attack after the first gains a +1 bonus to its attack roll, cumulatively, to a maximum bonus of +6.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Kyuzo Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Kyuzo Order-Relentless Assault-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Death Strike",
            "text": "_**Lethality Practice:** 17th level_\r\nYou've become a master of instant death. When you deal weapon damage to a creature that is surprised, it must make a Constitution saving throw against your lethal strike save DC. On a failed save, double the damage of your attack against the creature.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Lethality Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Lethality Practice-Death Strike-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Exploit Weakness",
            "text": "_**Mastermind Technique:** 15th level_\r\nYour training has taught you to find and exploit weaknesses in your prey. As a bonus action, you can impose disadvantage on the next saving throw the target of your Ranger's Quarry makes against an effect you control before the end of your next turn. Once you've done so, you must complete a short or long rest before you can do so again.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Mastermind Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Mastermind Technique-Exploit Weakness-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Command Droid",
            "text": "_**Mechanist Technique:** 15th level_\r\nYou can reprogram a droid and bring it under your control. As an action, you can touch one droid that you can see that is the target of your Ranger's Quarry. That creature must make a Intelligence saving throw against your tech save DC. If it succeeds, you can't use this feature on it again for 24 hours. If it fails, it becomes friendly to you and obeys your commands until you use this feature again.\r\nIntelligent droids are harder to control in this way. If the target has an Intelligence of 8 or higher, it has advantage on the saving throw. If it fails the saving throw and has an Intelligence of 12 or higher, it can repeat the saving throw at the end of every hour until it succeeds and breaks free.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Mechanist Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Mechanist Technique-Command Droid-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Command Droid",
            "text": "_**Mechanist Technique (Companion):** 15th level_\r\nYou can reprogram a droid and bring it under your control. As an action, you can touch one droid that you can see that is the target of your Ranger's Quarry. That creature must make a Intelligence saving throw against your tech save DC. If it succeeds, you can't use this feature on it again for 24 hours. If it fails, it becomes friendly to you and obeys your commands until you use this feature again.\r\nIntelligent droids are harder to control in this way. If the target has an Intelligence of 8 or higher, it has advantage on the saving throw. If it fails the saving throw and has an Intelligence of 12 or higher, it can repeat the saving throw at the end of every hour until it succeeds and breaks free.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Mechanist Technique (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Mechanist Technique (Companion)-Command Droid-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Vigilant Defender",
            "text": "_**Mounted Specialist:** 18th level_\r\nYou respond to danger with extraordinary vigilance. In combat, you get a special reaction that you can take once on every creature's turn, except your turn. You can use this special reaction only to make an opportunity attack, and you can't use it on the same turn that you take your normal reaction.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Mounted Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Mounted Specialist-Vigilant Defender-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Assuming Direct Control",
            "text": "_**Path of Communion:** 18th level_\r\nWhen a creature fails its saving throw against your Invasive Presence feature, the target becomes charmed by you for as long as Invasive Presence is active.\r\nWhile the target is charmed, you and your spirit have a telepathic link with it as long as you are within 100 feet of it. You and your spirit can use this telepathic link to issue commands to the creature while you are conscious (no action required), which it does its best to obey. You can specify a simple and general course of action, such as Attack that creature, Run over there, or Fetch that object. If the creature completes the order and doesn't receive further direction from you, it defends and preserves itself to the best of its ability.\r\nYou can use your action to take total and precise control of the target. Until the end of your next turn, the creature takes only the actions you choose, and doesn't do anything that you don't allow it to do. During this time you can also cause the creature to use a reaction, but this requires you to use your own reaction as well.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Communion",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Communion-Assuming Direct Control-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Aberrant Self",
            "text": "_**Path of Ethereality:** 18th level_\r\nYou no longer suffer the frailty of old age, and you can't be aged abnormally. You can still die of old age, however. Additionally, you no longer need food or water, and you no longer need to sleep. Lastly, the first time you take damage on each of your turns, you can roll your Kinetic Combat die and reduce the damage by that amount.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Ethereality",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Ethereality-Aberrant Self-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Legendary Battle Meditation",
            "text": "_**Path of Meditation:** 18th level_\r\nOnce per long rest, you can cast the master battle meditation force power without expending force points. While concentrating on master battle meditation, at the start of each of your turns, the power's die increases by one step (from d8 to d10, or d10 to d12).\r\nAdditionally, you gain a second reaction each round that you can only use for your Force-Empowered Allies feature. You can only take one reaction per turn.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Meditation",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Meditation-Legendary Battle Meditation-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Reflective Shield",
            "text": "_**Path of Synthesis:** 18th level_\r\nWhen you use your Force-Empowered Tech features, a barrier for energy shimmers into existence, surrounding you until the end of your next turn. When you take damage, you can mitigate the incoming energy and potentially reflect it back at your attacker. You use your reaction to have resistance against the triggering damage, and if the source of the damage is within 5 feet of you, they take half of the total damage dealt as ion.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Synthesis",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Synthesis-Reflective Shield-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Kinetic Bastion",
            "text": "_**Path of Tenacity:** 18th level_\r\nYou can protect allies even further from you. When a creature within 30 feet of you is hit by a melee weapon attack, you can use your reaction to teleport to them and extend your Kinetic Ward. If this damage is not reduced to 0, the warded creature takes any remaining damage.\r\nYou can use this feature a number of times equal to your Wisdom or Charisma modifier (your choice, a minimum of once). You regain all expended uses when you finish a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Tenacity",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Tenacity-Kinetic Bastion-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Ichor Conjuring",
            "text": "_**Path of Witchcraft:** 3rd and 11th level_\r\nYou learn to call on the spirits of beasts and grant them ichorous form. Once on each of your turns, when you cast a force power and deal necrotic damage to a creature, you can conjure a familiar within 5 feet of it (no action required). The familiar takes the form of a humanoid or beast made of green, glowing smoke, and it lasts for 1 minute, until you dismiss it as a bonus action, until you manifest another spirit, or until you're incapacitated or die.\r\nYour familiar has an AC equal to your universal force save DC, 1 hit point, and immunity to all conditions. If it has to make a saving throw, it uses your saving throw bonus for the roll. It is the same size as you regardless of its appearance, and it occupies its own space. On your turn, you can mentally command the familiar to move up to 30 feet in any direction (no action required). If your familiar is ever more than 30 feet from you at the end of your turn, it is destroyed. While you have a familiar, you gain the following benefits:\r\n- As a bonus action, you can use your magicks to teleport, swapping places with your familiar at a cost of 15 feet of your movement, regardless of the distance between the two of you.\r\n- When you take the Attack action on your turn, any attack you make with that action can originate from your space or the familiar's space. You make this choice for each attack.\r\n- When a creature that you can see within 5 feet of your familiar moves at least 5 feet away from it, you can use your reaction to make an opportunity attack against that creature as if you were in the familiar's space.\r\nStarting at 11th level, you can summon your familiar when you deal damage with any force power, instead of just necrotic. Additionally, you can summon your familiar when you use a Force-Empowered Self option on your turn.",
            "level": 3,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Witchcraft",
            "metadata": null,
            "partitionKey": "ExpandedContent",
            "rowKey": "Archetype-Path of Witchcraft-Ichor Conjuring-11",
            "timestamp": "2021-10-12T11:17:48.4377746+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A48.4377746Z'\""
        },
        {
            "name": "Stormcaller",
            "text": "_**Path of Witchcraft:** 18th level_\r\nYou've learned to command the elements to summon a fierce storm in a 30-foot radius around you. As an action, you can gain the following benefits for 1 minute:\r\n- You gain a flying speed equal to your walking speed.\r\n- You have resistance to energy, lightning, and necrotic damage.\r\n- Whenever a hostile creature enters this radius for the first time on a turn or starts its turn there, it takes 10 lightning damage.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Witchcraft",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Witchcraft-Stormcaller-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Beastwarden",
            "text": "_**Path of Witchcraft:** 13th and 17th level_\r\nYour bond with your beast companion strengthens, granting the following benefits while your beast companion is within 30 feet of you:\r\n- When you cast a force power that targets only yourself, and your beast companion is within range, you can also target your beast companion with that power. \r\n- If you or your beast have darkvision and the other doesn't, the other gains it with the same radius. If you both have darkvision, you both use the larger radius of the two, which then increases by 30 feet.\r\n- If you or your beast have advantage on Perception checks and the other doesn't, the other gains advantage on Perception checks. If you both have advantage on Perception checks, when either of you makes a Perception check with advantage, you can reroll one of the dice once.\r\nThis radius increases to 60 feet at 17th level.",
            "level": 13,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Witchcraft (Companion)",
            "metadata": null,
            "partitionKey": "ExpandedContent",
            "rowKey": "Archetype-Path of Witchcraft (Companion)-Beastwarden-17",
            "timestamp": "2021-10-12T11:17:48.4397758+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A48.4397758Z'\""
        },
        {
            "name": "Stormcaller",
            "text": "_**Path of Witchcraft:** 18th level_\r\nYou've learned to command the elements to summon a fierce storm in a 30-foot radius around you. As an action, you can gain the following benefits for 1 minute:\r\n- You gain a flying speed equal to your walking speed.\r\n- You have resistance to energy, lightning, and necrotic damage.\r\n- Whenever a hostile creature enters this radius for the first time on a turn or starts its turn there, it takes 10 lightning damage.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Witchcraft (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Witchcraft (Companion)-Stormcaller-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Disorienting Detonations",
            "text": "_**Path of the Corsair:** 18th level_\r\nWhen a creature fails the saving throw against your Force-Empowered Detonators feature, you can spend 2 force points to subject it to the effects of one of the following force powers: affliction, force blind/deafen, stun, or stun droid. They automatically fail the saving throw for the selected power, but the effects only last until the end of your next turn.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of the Corsair",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of the Corsair-Disorienting Detonations-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Dance",
            "text": "_**Performance Practice:** 17th level_\r\nYour confidence when putting on a show has extended into combat. You add your Charisma modifier to initiative checks. Additionally, any creature who fails a saving throw against your Dazzling Step save DC has disadvantage on the first attack roll they make against you each turn until the end of your next turn.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Performance Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Performance Practice-Master of Dance-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Strength Before Weakness",
            "text": "_**Praetorian Specialist:** 18th level_\r\nYour fighting spirit can delay the grasp of death. If you take damage that reduces you to 0 hit points, you can use your reaction to delay falling unconscious, and you can immediately take an extra turn. While you have 0 hit points during that extra turn, taking damage causes death saving throw failures as normal, and three death saving throw failures can still kill you. When the extra turn ends, you fall unconscious if you still have 0 hit points.\r\nOnce you've used this feature, you can't use it again until you finish a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Praetorian Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Praetorian Specialist-Strength Before Weakness-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "On the Hunt",
            "text": "_**Predator Technique:** 15th level_\r\nWhen you use your Predator's Resolve feature, a number of friendly creatures you choose up to your Intelligence modifier that you can see within 30 feet of you also gain the benefits of the feature.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Predator Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Predator Technique-On the Hunt-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Razor Focus",
            "text": "_**Pugnacity Practice:** 17th level_\r\nYou can enter a hyper-focused state of mind for 1 minute as a bonus action. You must maintain concentration, as if concentrating on a power. For the duration, each time you successfully deal Sneak Attack damage against a creature, you gain two additional Sneak Attack dice, cumulatively, as your attacks become increasingly precise. These additional dice are lost when your focus ends, whether through failing to maintain concentration or after 1 minute.\r\nThe first time you use this feature, you suffer no ill effect. If you use this feature again before you finish a long rest, you suffer one level of exhaustion each time you use it.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Pugnacity Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Pugnacity Practice-Razor Focus-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master Duelist",
            "text": "_**Ruffian Practice:** 17th level_\r\nYour mastery of the blade lets you turn failure into success in combat. If you miss with an attack roll, you can roll it again with advantage. Once you do so, you can't use this feature again until you finish a short or long rest.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Ruffian Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Ruffian Practice-Master Duelist-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Sabotage",
            "text": "_**Saboteur Practice:** 17th level_\r\nYou gain the ability to sabotage a tech power in the process of being cast. When a hostile creature casts a tech power, and you are the target of the tech power or within its area of effect, you can use your reaction to force that creature to make an Intelligence saving throw against your tech save DC. On a successful save, the power is cast as normal.\r\nOn a failed save, you negate the power's effects, and the caster takes 1d6 lightning damage per level of the power it was casting. Additionally, on a failed save, the caster's tech focus used to cast the tech power is overloaded and can't be used to cast tech powers for 1 minute.\r\nAt the end of each of the caster's turns, it can repeat the Intelligence saving throw. On a success, it can use the tech focus to cast tech powers again.\r\nOnce you've used this feature, you can't use it again until you finish a long rest.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Saboteur Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Saboteur Practice-Sabotage-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Double Tap",
            "text": "_**Scrapper Practice:** 17th level_\r\nYou can deal Sneak Attack damage twice per turn, but you can't deal more than your total Sneak Attack dice to a single target per turn.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Scrapper Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Scrapper Practice-Double Tap-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Determination",
            "text": "_**Shii-Cho Form:** 20th level_\r\nThe erratic fluidity of your movement confounds even the most determined of foes. Your Strength or Dexterity and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic, energy, and ion damage from weapons.\r\n- Attack rolls made against you can't have advantage.\r\n- When more than one creature is within 5 feet of you, you gain a bonus to your Armor Class equal to the number of creatures within 5 feet of you, up to your Wisdom or Charisma modifier (your choice, minimum of one).\r\n- When you use your Sarlaac Sweep feature, you have advantage on the attack roll, and you can apply the bonus damage to every creature within 5 feet of you.\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Shii-Cho Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Shii-Cho Form-Master of Determination-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Unwavering Self",
            "text": "_**Sokan Form:** 7th and 15th level_\r\nIf you fail a Strength, Dexterity, or Constitution saving throw, you can reroll the die. You must use the new roll.\r\nOnce you've used this feature, you must complete a long rest before you can use it again. At 15th level you can use this feature twice between long rests.",
            "level": 7,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Sokan Form",
            "metadata": null,
            "partitionKey": "ExpandedContent",
            "rowKey": "Archetype-Sokan Form-Unwavering Self-7",
            "timestamp": "2021-10-12T11:17:47.9383557+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A47.9383557Z'\""
        },
        {
            "name": "Master of Persistence",
            "text": "_**Sokan Form:** 20th level_\r\nYou are an unrelenting force on the field of battle. Your Strength and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic, energy, and ion damage from weapons.\r\n- You ignore effects that would reduce your speed.\r\n- Once per turn, when you push a creature, you can move up to 10 feet as a part of this push without provoking opportunity attacks. If you end this movement within 5 feet of that creature, you can make one melee weapon attack (no action required).\r\nThis effect ends early if you are incapacitated or die. Once you've used this feature, you can't use it again until you complete a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Sokan Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Sokan Form-Master of Persistence-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Reprisal",
            "text": "_**Teleportation Technique:** 15th level_\r\nWhen you would be affected by a weapon or tech power that requires a Dexterity saving throw or attack roll and would affect only you, you can use your reaction to instantaneously create a pair of portals to redirect that power to another target within 30 feet. If the weapon or power required a melee or ranged attack roll, make a melee or ranged tech attack roll against the new target, as appropriate. If it required a Dexterity saving throw, the new target must make a Dexterity saving throw against your tech save DC.\r\nOnce you've used this feature, you must complete a short or long rest before you can use it again.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Teleportation Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Teleportation Technique-Reprisal-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Spitting Rawl",
            "text": "_**Teras Kasi Order:** 17th level_\r\nYou have learned to harness your strikes in a blistering fury. On your turn, when a creature takes damage from you three times, you can make up to three additional unarmed strikes against the creature (no action required). The first additional unarmed strike costs 1 focus point and deals 1d12 additional psychic damage on a hit, and each unarmed strike after the first costs 1 additional focus point and deals 1d12 additional psychic damage on a hit, cumulatively.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Teras Kasi Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Teras Kasi Order-Spitting Rawl-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Blessing of the Tree of Light",
            "text": "_**Totem Specialist:** 18th level_\r\nYou learn how to share your totem's power with your allies. When you use your Totemic Might feature, you can choose one willing creature you can see within 60 feet of you. The chosen creature also gains the benefits of your Totemic Might feature. If you are incapacitated or killed, this effect immediately ends for both of you.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Totem Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Totem Specialist-Blessing of the Tree of Light-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Deception",
            "text": "_**Trakata Form:** 20th level_\r\nYour skill with a lightweapon is both mesmerizing and confounding. Your Dexterity and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic, energy, and ion damage from weapons.\r\n- Your attack rolls can't suffer from disadvantage.\r\n- Whenever a creature misses you with a melee attack, it takes 5 energy damage.\r\n- Whenever a creature hits you with a melee attack, it takes damage equal to half of the damage you take from the attack.\r\nThis effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Trakata Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Trakata Form-Master of Deception-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Comic Frenzy",
            "text": "_**Trickster Order:** 17th level_\r\nYou gain the ability to make an overwhelming number of attacks against a group of enemies. When you use your Flurry of Blows, you can make up to three additional attacks with it (up to a total of five Flurry of Blows attacks), provided that each Flurry of Blows attack targets a different creature this turn.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Trickster Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Trickster Order-Comic Frenzy-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Unity",
            "text": "_**Vonil/Ishu Form:** 20th level_\r\nYou and your allies are a paragon of harmony. Your Strength or Dexterity (your choice) and Constitution scores increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action and choose an ally within 60 feet of you to gain the following benefits for 1 minute:\r\n- You and the chosen ally have resistance to kinetic and energy damage.\r\n- Neither you nor the chosen ally can have disadvantage on attack rolls.\r\n- Both you and the chosen ally's critical hit ranges increase by 1.\r\nThis effect ends early if either you or the chosen ally are incapacitated or die, or if the chosen ally is ever more than 60 feet away from you. Once you've used this feature, you can't use it again until you complete a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Vonil/Ishu Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Vonil/Ishu Form-Master of Unity-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Unity",
            "text": "_**Vonil/Ishu Form (Companion):** 20th level_\r\nYou and your companion are a paragon of harmony. Your Strength or Dexterity (your choice) and Constitution scores increase by 2. Your maximum for those scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute, as long as your companion is within 60 feet of you:\r\n- You and your companion have resistance to kinetic and energy damage.\r\n- Neither you nor your companion can have disadvantage on attack rolls.\r\n- Both you and your companion's critical hit ranges increase by 1.\r\nThis effect ends early if either you or your companion are incapacitated or die, or if your companion is ever more than 60 feet away from you. Once you've used this feature, you can't use it again until you complete a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Vonil/Ishu Form (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Vonil/Ishu Form (Companion)-Master of Unity-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Dynamic Attachment",
            "text": "_**Way of Confluence:** 18th level_\r\nWhile you have temporary hit points, you have resistance against the damage of force powers, and your force powers ignore resistances.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Confluence",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Confluence-Dynamic Attachment-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "The Force Unleashed",
            "text": "_**Way of Endurance:** 18th level_\r\nAs an action, you can choose a point within 60 feet. Each creature of your choice within 30 feet of that point must make a Constitution saving throw against your universal force save DC. On a failed save, a creature takes 5d10 force damage and suffers 1 level of exhaustion. On a successful save, a creature takes half damage and does not suffer exhaustion.\r\nFor each creature that fails this saving throw, a friendly creature within 30 feet of them can regain hit points equal to the amount of damage dealt. A friendly creature can only gain this benefit once per turn.\r\nYou can use this feature a number of times equal to your Wisdom or Charisma modifier (your choice, a minimum of once). You regain all expended uses when you finish a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Endurance",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Endurance-The Force Unleashed-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Sapping Storm",
            "text": "_**Way of Manipulation:** 18th level_\r\nWhen you reduce a hostile creature to 0 hit points while Saber Storm is active, you gain temporary force points equal to your Wisdom or Charisma modifier (your choice, minimum of one). These temporary force points can not exceed your Wisdom or Charisma modifier (your choice), and when you would spend a force point while you have temporary force points, the temporary force points are spent first. When Saber Storm ends, you lose any remaining temporary force points.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Manipulation",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Manipulation-Sapping Storm-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Tutaminis Mastery",
            "text": "_**Way of Negation:** 18th level_\r\nWhen you use a Force-Empowered Casting option, you can spend a power surge to use it without spending additional force points.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Negation",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Negation-Tutaminis Mastery-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "My Ally is the Force",
            "text": "_**Way of Telekinetics:** 18th level_\r\nYou can manipulate creatures of Gargantuan size or smaller with your force powers and Way of Telekinetics features.\r\nAdditionally, whenever a force power you cast pushes or pulls a creature, you can increase the distance of that push or pull by an additional 20 feet.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Telekinetics",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Telekinetics-My Ally is the Force-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Got Your Back",
            "text": "_**Way of Tutelage:** 14th and 17th level_\r\nOnce per turn, when your companion is within 10 feet of you, and both you and your companion have to make a saving throw to resist the same effect, either you or your companion can choose to have disadvantage on the save. If either of you do so, the other of the two of you gains advantage on the save. You can use this feature before or after you both make the saving throw, but you must do so before the GM says whether the save succeeds or fails.\r\nAt 17th level, your companion must be within 60 feet of you to benefit from this feature. ",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Tutelage",
            "metadata": null,
            "partitionKey": "ExpandedContent",
            "rowKey": "Archetype-Way of Tutelage-Got Your Back-17",
            "timestamp": "2021-10-12T11:17:47.9003243+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A47.9003243Z'\""
        },
        {
            "name": "Now I Am The Master",
            "text": "_**Way of Tutelage:** 18th level_\r\nYour companion has learned almost all that it can from you. As an action on its turn, your companion can take the lead, gaining the following benefits for 1 minute:\r\n- It gains temporary hit points equal to twice its level.\r\n- Once per turn, when it deals damage or restores hit points, it can roll an additional die.\r\n- It gains resistance to kinetic and energy damage.\r\nThis effect ends early if your companion is incapacitated or dies. Once your companion has used this feature, it can't use it again until it finishes a long rest.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of Tutelage",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Tutelage-Now I Am The Master-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Clarity of Vision",
            "text": "_**Way of the Seer:** 18th level_\r\nThe visions in your dreams intensify and paint a more accurate picture in your mind of what is to come. You roll three d20s for your Force Visions feature, rather than two.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Way of the Seer",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of the Seer-Clarity of Vision-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Guided Strikes",
            "text": "_**Whills Order:** 17th level_\r\nYour first ranged weapon attack and your first melee weapon attack each turn deal additional damage equal to your Wisdom or Charisma modifier (your choice, a minimum of +1).",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Whills Order",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Whills Order-Guided Strikes-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of the Unorthodox",
            "text": "_**Ysannanite Form:** 20th level_\r\nYou've mastered the unity between blaster and blade. Your Dexterity and Wisdom or Charisma scores (your choice) increase by 2. Your maximum for these scores increases by 2. Additionally, you can use your action to gain the following benefits for 1 minute:\r\n- You have resistance to kinetic, energy, and ion damage from weapons.\r\n- When you hit a creature with a ranged weapon attack, you have advantage on the next melee weapon attack you make against that creature. When you hit a creature with a melee weapon attack, you have advantage on the next ranged weapon attack you make against that creature.\r\n- When you roll below half the maximum on a damage die, you can treat the roll as if you'd rolled half the maximum on the damage die. You can only affect a number of dice up to half your Wisdom or Charisma modifier (your choice, rounded up, minimum of one) in this way.\r\nThis effect ends early if you are incapacitated or die. Once you use this feature, you can't use it again until you finish a long rest.",
            "level": 20,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Ysannanite Form",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Ysannanite Form-Master of the Unorthodox-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Self-Sustain",
            "text": "_**Sawbones Practice:** 17th level_\r\nYou have advantage on death saving throws.\r\nAdditionally, when you are stabilized, you regain 1 hit point. Once you've used this feature, you can't use it again until you finish a short or long rest.",
            "level": 17,
            "sourceEnum": 0,
            "source": "Archetype",
            "sourceName": "Sawbones Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Sawbones Practice-Self-Sustain-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Cure-All",
            "text": "_**Triage Technique:** 15th level_\r\nYour healing becomes even more potent. When you restore hit points to a creature as a bonus action using your Mark of Triage feature, you can also end one of the following conditions afflicting it: blinded, deafened, diseased, paralyzed, or poisoned.",
            "level": 15,
            "sourceEnum": 0,
            "source": "Archetype",
            "sourceName": "Triage Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Triage Technique-Cure-All-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Mechu-Deru Mastery",
            "text": "_**Way of Technology:** 18th level_\r\nYou can cast one 5th-level tech power of your choice at its base level. The power counts as a universal force power for you, and you do not require force points to cast this power. Once you've done so, you can't do so again until you complete a long rest.",
            "level": 18,
            "sourceEnum": 0,
            "source": "Archetype",
            "sourceName": "Way of Technology",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Way of Technology-Mechu-Deru Mastery-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Thief's Reflexes",
            "text": "_**Acquisitions Practice:** 17th level_\r\nYou can take two turns during the first round of any combat. You take your first turn at your normal initiative and your second turn at your initiative minus 10. You can't use this feature when you are surprised.\r\nAdditionally, you learn to utilize the momentum of your fall to make deadly vertical strikes. Whenever you fall at least 50 feet and land within 5 feet of an enemy creature you can use your reaction to make one weapon attack against that creature. If the attack is a Sneak Attack, you can deal three additional weapon dice worth of damage and the creature must make a Dexterity saving throw or be knocked prone.",
            "level": 17,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Acquisitions Practice",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Acquisitions Practice-Thief's Reflexes-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Superior Hunter's Defense ",
            "text": "_**Hunter Technique:** 15th level_\r\nYou gain one of the following features of your choice.\r\n#### Evasion\r\nWhen you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on a saving throw, and only half damage if you fail.\r\n#### Stand Against the Tide\r\nWhen a hostile creature misses you with a melee attack, you can use your reaction to force that creature to repeat the same attack against another creature (other than itself) of your choice.\r\n#### Uncanny Dodge\r\nWhen an attacker that you can see hits you with an attack, you can use your reaction to halve the attack's damage against you.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Hunter Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Hunter Technique-Superior Hunter's Defense -15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Shadow's Wrath",
            "text": "_**Path of Shadows:** 18th level_\r\nYour training has taught you advanced techniques while you maneuver in the shadows. While you are hidden from your target, the first attack roll you make each round does not automatically reveal your presence. Make a Dexterity (Stealth) check against your target's Wisdom (Perception) check. On a success, you remain hidden. If you are also invisible, you remain invisible.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Path of Shadows",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Path of Shadows-Shadow's Wrath-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Slayer's Counter",
            "text": "_**Slayer Technique:** 15th level_\r\nIf the target of your Ranger's Quarry feature forces you to make a saving throw, you can use your reaction to make one weapon attack against it. You make this attack immediately before making the saving throw. If your attack hits, you automatically succeed on the saving throw, in addition to the attack's normal effects.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Slayer Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Slayer Technique-Slayer's Counter-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Stalker's Dodge",
            "text": "_**Stalker Technique:** 15th level_\r\nWhenever a creature attacks you and does not have advantage, you can use your reaction to impose disadvantage on the creature's attack roll against you. You can use this feature before or after the attack roll is made, but it must be used before the outcome of the roll is determined.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Stalker Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Stalker Technique-Stalker's Dodge-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Inquisitor's Wrath",
            "text": "_**Inquisitor Technique:** 15th level_\r\nYou can cast the force suppression and sever force force powers at 3rd level against the target of your Ranger's Quarry without expending tech points. If they are within 30 feet of you, you have advantage on the forcecasting ability check for these powers.\r\nYou can use this feature a number of times equal to 1 + your Intelligence modifier (a minimum of once). You regain all expended uses when you finish a long rest.\r\nThe radius of this feature increases to 60 feet at 17th level.",
            "level": 15,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Inquisitor Technique",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Inquisitor Technique-Inquisitor's Wrath-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Spiked Retribution",
            "text": "_**Armored Approach:** 14th level_\r\nWhen a creature within 5 feet of you hits you with a melee attack, the attacker takes kinetic damage equal to your Strength modifier, as long as you are wearing your spiked armor and you aren't incapacitated.\r\n\r\nIf you are raging, you add your rage damage bonus to this damage.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Armored Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Armored Approach-Spiked Retribution-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Hunter's Call",
            "text": "_**Beastmaster Approach:** 14th and 17th level_\r\nWhen you enter your rage, you can choose up to 5 allies that you can see within 30 feet of you. You gain 5 temporary hit points for each creature. For the duration of your rage, once on each of their turns, an affected ally can add your rage damage bonus to a weapon attack's damage roll.\r\n\r\nYou can use this feature five times. You gain an additional use at 17th level. You regain all expended uses when you finish a long rest.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Beastmaster Approach",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Beastmaster Approach-Hunter's Call-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Hunter's Call",
            "text": "_**Beastmaster Approach:** 14th and 17th level_\r\nWhen you enter your rage, you can choose up to 5 allies that you can see within 30 feet of you. You gain 5 temporary hit points for each creature. For the duration of your rage, once on each of their turns, an affected ally can add your rage damage bonus to a weapon attack's damage roll.\r\n\r\nYou can use this feature five times. You gain an additional use at 17th level. You regain all expended uses when you finish a long rest.",
            "level": 14,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Beastmaster Approach (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Beastmaster Approach (Companion)-Hunter's Call-14",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "No Soldier Left Behind",
            "text": "_**Fireteam Specialist:** 18th level_\r\nWhile under the effects of On Your Six, if either you or your ally are reduced to 0 hit points, you can end On Your Six to have them drop to 1 hit point instead. When you do so, the effects of On Your Six persist until the start of your next turn.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Fireteam Specialist",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Fireteam Specialist-No Soldier Left Behind-18",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "No Soldier Left Behind",
            "text": "_**Fireteam Specialist:** 18th level_\r\nWhile under the effects of On Your Six, if either you or your companion are reduced to 0 hit points, you can end On Your Six to have them drop to 1 hit point instead. When you do so, the effects of On Your Six persist until the start of your next turn.",
            "level": 18,
            "sourceEnum": 1,
            "source": "Archetype",
            "sourceName": "Fireteam Specialist (Companion)",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Archetype-Fireteam Specialist (Companion)-No Soldier Left Behind-18",
            "timestamp": "?",
            "eTag": "?"
        },












        {
            "name": "One with the Force",
            "text": "_**Consular:** 20th level_\r\nYour attunement to the Force is absolute. Your Wisdom or Charisma score increases by 4, and your maximum for this score increases by 4. Additionally, you gain mastery over a single force power, and can cast it with little effort. Choose one 3rd-level force power that you know as your signature power. You can cast it once at 3rd level without expending force points. When you do so, you can't do so again until you finish a short or long rest.\r\nIf you want to cast it at a higher level, you must expend force points as normal.",
            "level": 20,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Consular",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Consular-One with the Force-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Infuse Item",
            "text": "_**Engineer:** 10th level_\r\nYour infuse item bonus increases to +2 at 10th level.",
            "level": 10,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Engineer",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Engineer-Infuse Item-10",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Infuse Item",
            "text": "_**Engineer:** 15th level_\r\nYour infuse item bonus increases to +3 at 15th level.",
            "level": 15,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Engineer",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Engineer-Infuse Item-15",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Tech Mastery",
            "text": "_**Engineer:** 20th level_\r\nYour mastery of technology is unrivaled. Your Constitution and Intelligence scores increase by 2. Your maximum for those scores increases by 2.\r\nAdditionally, when you roll initiative and have no uses of Potent Aptitude left, you regain one use.",
            "level": 20,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Engineer",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Engineer-Tech Mastery-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Indomitable",
            "text": "_**Fighter:** 13th level_\r\nYou can use your Indomitable feature two times between long rests starting at 13th level.",
            "level": 13,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Fighter",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Fighter-Indomitable-13",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Action Surge",
            "text": "_**Fighter:** 17th level_\r\nStarting at 17th level, you can use your Action Surge feature twice before a rest.",
            "level": 17,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Fighter",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Fighter-Action Surge-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Indomitable",
            "text": "_**Fighter:** 17th level_\r\nYou can use your Indomitable feature three times between long rests starting at 17th level.",
            "level": 17,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Fighter",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Fighter-Indomitable-17",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Master of Combat",
            "text": "_Fighter**:** 20th level_\r\nYou are the master of combat. Your Strength or Dexterity score increases by 2, and your Constitution score increases by 2. Your maximum for those scores increases by 2.\r\nAdditionally, you can attack four times, instead of once, whenever you take the Attack action on your turn.",
            "level": 20,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Fighter",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Fighter-Master of Combat-20",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Focus",
            "text": "_**Monk:** 2nd and 11th level_\r\nYour training allows you to harness the mystic energy of focus. Your access to this energy is represented by a number of focus points. Your monk level determines the number of points you have, as shown in the Focus Points column of the monk table.\r\nYou can spend these points to fuel various focus features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more focus features as you gain levels in this class.\r\nWhen you spend a focus point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended focus back into yourself. You must spend at least 30 minutes of the rest meditating to regain your focus points.\r\nYou use your choice of Wisdom or Charisma for your focus ability. You use the chosen ability modifier whenever a feature refers to your focus ability. Additionally, you use the chosen ability modifier when making an attack with a focus feature or setting the saving throw DC for one.\r\n___\r\n**Focus save DC** = 8 + your proficiency bonus + your Wisdom or Charisma modifier (your choice)\r\n___\r\n**Focus attack modifier** = your proficiency bonus + your Wisdom or Charisma modifier (your choice)\r\n___\r\n#### Flurry of Blows\r\nWhen you make your Martial Arts bonus action attack, you can spend 1 focus point to make an additional unarmed strike (no action required). At 11th level, you can instead spend 2 focus points to make two additional unarmed strikes.\r\n#### Patient Defense\r\nWhen you use your bonus action to Disengage, you can spend 1 focus point to also Dodge (no action required). At 11th level, you can instead spend 2 focus points to Dodge and gain an additional reaction until the start of your next turn. You can only take one reaction per turn.\r\n#### Step of the Wind\r\nWhen you use your bonus action to Dash, you can spend 1 focus point to double your jump distance for the turn. At 11th level, you can instead spend 2 focus points to gain a flying speed equal to your walking speed until the end of your turn, though you fall if you end your speed in the air and nothing else is holding you aloft.",
            "level": 2,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Monk",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Monk-Focus-2",
            "timestamp": "2021-10-12T11:17:35.8872913+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A35.8872913Z'\""
        },
        {
            "name": "Unarmored Movement",
            "text": "_**Monk:** 3rd and 9th level_\r\nYour speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Unarmored Movement column of the monk table.\r\nAt 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move.",
            "level": 3,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Monk",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Monk-Unarmored Movement-3",
            "timestamp": "2021-10-12T11:17:35.8672754+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A35.8672754Z'\""
        },
        {
            "name": "Expertise",
            "text": "_**Operative:** 1st and 6th level_\r\nChoose two of your skill proficiencies, or one of skill proficiencies and one of your tool proficiencies, or two of your tool proficiencies. You gain expertise in those skills or tools.\r\nAt 6th level, you can choose two more of your proficiencies (in skills or tools) to gain this benefit.",
            "level": 1,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Operative",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Operative-Expertise-1",
            "timestamp": "2021-10-12T11:17:35.8742813+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A35.8742813Z'\""
        },
        {
            "name": "Expertise",
            "text": "_**Scholar:** 3rd and 10th level_\r\nChoose two of your skill proficiencies, or one of skill proficiencies and one of your tool proficiencies, or two of your tool proficiencies. You gain expertise in those skills or tools.\r\nAt 10th level, you can choose another two proficiencies (in skills or tools) to gain this benefit.",
            "level": 3,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Scholar",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Scholar-Expertise-3",
            "timestamp": "2021-10-12T11:17:35.8822875+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A35.8822875Z'\""
        },
        {
            "name": "Sage Advice",
            "text": "_**Scholar:** 13th level_\r\nStarting at 13th level, you regain the ability to use your Sage Advice feature after you complete a short or long rest.",
            "level": 13,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Scholar",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Scholar-Sage Advice-13",
            "timestamp": "?",
            "eTag": "?"
        },
        {
            "name": "Expertise",
            "text": "_**Scout:** 6th and 14th level_\r\nChoose two of your skill proficiencies, or one of skill proficiencies and one of your tool proficiencies, or two of your tool proficiencies. You gain expertise in those skills or tools.\r\nAt 14th level, you can choose another two proficiencies (in skills or tools) to gain this benefit.",
            "level": 6,
            "sourceEnum": 0,
            "source": "Class",
            "sourceName": "Scout",
            "metadata": null,
            "partitionKey": "Core",
            "rowKey": "Class-Scout-Expertise-6",
            "timestamp": "2021-10-12T11:17:35.8932972+00:00",
            "eTag": "W/\"datetime'2021-10-12T11%3A17%3A35.8932972Z'\""
        }
    ]
}
